{"areas": {"full": {"tabs": {"default": "A culture of shadowy and subtle people, specializing in stealth, illusion, espionage. It is said that the Shadowfaust race were directly descended between the love of the [[Shadow Mother]] and [[Fygnell]] himself. The Shadowfaust were blessed by Fygnell and were given twice the lifespan of ordinary humans.\n\n[[toc]]\n\n# Pelinial Plane\n\n\n# Physiology\nSkin varies, commonly light. Commonly has dark hair and always had crimson eyes that may vary in shades.\n\n# Origin\n\n\n# History\nAll shadowfaust descended from a Princess in a forgotten empire. Lyrea Faust, the fourth Princess was a forgotten princess of the then Empire. But after the death of her beloved mother, she became a powerful illusionist and assassin who eventually became powerful enough that she conceived and understood the Aspect of Mystery. This allowed her to Apotheosis and become a Deity. She is, what people would call, a Progenitor, mortals who reached Deity hood. But during this time, she met the Fygnell who went to the mortal world to have fun. The two of them became companions as they journeyed. Eventually, the two fell in love and from their love was born a child neither fully human nor fully divine. After many generations, the Shadowfaust Clan expanded and became a race of extremely powerful stealth users. While they remain as one of the fewer in population, they remained as one of the strongest race.\n\nThe Shadowfaust considered the Pelinial Planes, a small region in Loretia as their Ancestral Home as this is the place where Lyrea’s mother was born.\n\n# Society and Culture\nMarriage is an extremely sacred ritual to the Shadowfaust. Because their race is connected by the gift of Madness and Rationality of Fygnell, relationship is very important to them. When a Shadowfaust cheated on their partner, this is usually met with blood and carnage as the gift of madness within them will activate. This is why most races are very cautious in forming bonds with a Shadowfaust. While the bond will be extremely strong, should they transgress this, they will be met with a maddened lover who will destroy everything in their wake.\n\n**Sacred Parentage** - The shadowfaust are unique from other races in that no Shadowfaust can be born unless the Queen Mother gives her blessing upon them. The Shadowfaust, no matter how many sex they do, will not be able to conceive a child. Is only by going on a pilgrimage and showing to the Queen Mother that they are worthy to care for a child, that they will be good parents, that they will be able to conceive a child. They then sign a pact with the Queen Mother that they will be good parents. Those that transgress this pact will be sent to Nifelheim upon their death and suffer and only if their child undergoes the Redemption Pilgrimage for their parents, will they be forgiven.\n\n# Religion\n## Revered Symbol:\n* The shadowfaust revere the Symbol of the Shadow Owl.\n\n## Worshipped Gods:\n* [[Shadow Mother]] - Lyrea, also known as the Shadow Mother, is worshipped by the Shadowfausts as their Ancestral Mother who protects and guides them. The Shadowfaust follows the Subtle Code written by the Queen Mother.\n\n* [[Fygnell]] – The Shadowfausts considers Fygnell as their Ancestral Father who gave them the gift of madness and rationality.\n\n* [[mad scholar | Thaal]] – Whilst not worshipped in the same way the Shadowfaust would worship Fygnell or the Queen Mother, Thaal is a legendary figure among the shadowfaust tribe as a being that represents the epitome of human madness, the achievement of threatening the very gods themselves just for his whims.\n\n## Practices\nThe Shadowfaust has a very intricate and mysterious practices. Due to its shadow nature, many races fears and hates their practices.\n\n### Ritual of the Blood Moon\nThe Shadowfaust has an occult ritual feared and detested by other races. During the night of a full blood moon, happening once a year, the influence of the [[Shadow Mother]] becomes the strongest, allowing her to easily penetrate the [[Eternal Veil | veil that cloaks Mirdum]].\n\nTo summon the Shadow Mother, a sacrifice must be prepared. Namely, the heart of a freshly killed wicked person, three flowers of a [[Shadowrose]], and a golden dagger the seeped in the blood of fifteen wicked men. Using the blood of the wicked person whose heart was freshly plucked, a magic circle is carved with the golden dagger, written with Ancient [[Shadowfaust handwriting]]. Then the heart will be placed at the center of the circle. The summoner will then chant the [[mothers-cradle-verse | Mother's Cradle Verse]], before stabbing the heart with the golden dagger and offering it the [[Shadowrose]].\n\nOnce the [[Shadow Mother]] finds satisfaction in one's performance of the Ritual, the Magic circle will open a gate towards the Abyss, allowing the Shadow Mother herself to manifest her physical form within [[Mirdum]].\n\nThe summoner will suddenly be filled with great joy, shedding tears of happiness and falling into the Mother's warmth embrace like a child. The mother will then caress the summoner and make them feel at ease and safe.\n\nThough if the summoner fails to follow the ritual correctly, or does not show enough reverence to the [[Shadow Mother]], she will see this as an Insult and a gate will open within the magic circle, summoning a terrifying Shadow Eldra. The summoner must then defeat this Eldra if they wish to regain the Shadow Mother's favor, before kneeling and offering her five freshly plucked heart of the Wicked.\n\n### The Mother's Passage\nThe existence of the Shadowfaust race is so intricately intertwined with the existence of the [[Shadow Mother]] that no children can be born without her approval. The [[Shadow Mother]] is known as the Patron Guardian of Children, and by her Will, no children within [[Mirdus]] can be unrighteously harmed. Her influence over the protection of children is so powerful that other races have worshiped her to protect their offspring, albeit with a different name.\n\nFor a Shadowfaust to gain the Mother's Approval so that they may have a child, she must go on a pilgrimage and passed the [[Mothers Passage | Mother's Passage]], a sacred trial built by the [[Shadow Mother]] herself, located within a hidden space inside the [[Pelinial Planes]],\n\nOnce the Shadowfaust has proven themselves worthy of becoming parents, only then will they successfully pass through the [[Mothers Passage | Mother's Passage]] alive. Should they fail, they will be thrown away and they cannot try again for another three years. If they succeed, the woman will be successfully pregnant with a healthy child during next copulation.\n\n# Notable Figures\n* [[Euphemia Trysten]] - Is the Empress that united all of Loreteia. She is part Celt and part Shadowfaust.\n\n# Trivia"}}}}