{"areas": {"full": {"tabs": {"default": "Denizens of Aulmeria. Crafty and very intelligent, the Arseans were the ones who led the Continental Conquest of Euphemia the Conquerer and successfully conquered all of Loreteia. They pride themselves in their strategical, crafts, mercantile, and oratorical skills. Despite their weaker strength, they have the strongest stamina among the human race.\n\n[[toc]]\n# Aulmeria\nAulmeria is the central region of Loreteia and has been the heart of many Empires in the past. As it is centered in the continent, it experiences four seasons. It contained many grassy plains, forest, and a natural mountain range that separates it from the other regions, making it easy to defend against foreign invaders. Aulmeria is the native homes of Nemines and later on, Invirians.\n\n# Physiology\nAppearance. The skins of Arseans varies in color but are mostly light. Their hair is commonly blonde, light blonde, platinum, or sometimes brown.\n\nAbilities. They do not have much in terms of physical strength but they are the most intelligent and gifted in intellect amongst men. Because of this, the Arseans has been known as a race of eloquent and scholarly men. This is the reason why most Emperors are predominantly Arsean as the gift of intelligence is far more needed when ruling. Their sophisticated ways often clash with Celts who sees Arseans as sissies and weak pussies. Arseans are said to be the descendants of a group of humans who once lived in Aulmeria, called the Invirians who, according to scriptures, are generally more intelligent than Arseans, whose most intellectual member of them is but an average among Invirians.\n\n# Origin\nThe Arseans are said to have come from the western continent. Ancient Arseans were known as [[Arkean]]. According to the earliest text left behind by Arsean Ancestors, the western continent, also known as the Forbidden Continent was known to them as, \"The Demon's Land\". The Arseans Ancestors back then were weak and fragile and easily devoured by superior races. As a consequence, only the most intelligent and craftiest of the Arsean Ancestors survived, causing them to become the most inherently intelligent human race.\n\n# History\nMany Emperors have originated from the Arsean race.\n\n# Society and Culture\nArseans worship [[Annariah]] as their Chief Deity after [[Euphermia]] conquered all of Loreteia and declared as such. Previously, [[Annue]] was the chief deity of Arseans.\n\n### Burials\nArseans cover their dead with Ashes from burnt Alfnur Tree. It is generally believed in Arsean culture that;\n\n> Man cameth from Ash, and Man shall cometh to Ash\n\nThis belief stems from the legends of how Anu created Man  from ashes and thus when the first man died, he covered their body in Ash.\n\n### Architecture\nBecause Arseans live in flat, grassy prairie lands, their buildings developed to be made of sod and stone due to the lack of wood in the area. Houses were built to be wide rather than tall, but houses of nobles have 2nd floors and those of Kings have third or fourth floors, made of wood.\n\nBecause of the high concentration of clay in the area, they use the clay they found in nearby rivers to create walls for their sod houses.\n\nAulmeria experiences regular strong winds and thus, their people did not developed clay houses but sod houses.\n\nWithin cities, the technology of mortar spread from [[Haelgrim]], allowing Arseans to build giant city walls to protect them from the wind \n\n### Farming\nArseans mostly farm with crops such as rye, wheat, and corn. Most villages lives by the river and thus fishing became a part of their daily lives.\n\n### Smithing\nArseans mostly use bronze in the current era, with copper mined north-east of Aulmeria and Tin imported from the south.\n\n### Trade\nThe arseans are great trades and also great builders of road. Most Arseans puts a great deal of value over trading as it is central to their belief that in the afterlife, one would trade the most valuable thing one cultivates in life for a good afterlife.\n\nThus trades are sacred in Arsean culture and any form of cheating or thievery is highly frowned upon in society.\n\n\n## Food\nMost arseans live on a bread, cheese, milk, and fish. With each village having communal cattle. A practice that they kept from the time they were still nomads.\n\n\n## Education\nThe education of children mostly consists of teaching children about their parent's crafts, the gods and goddesses, myths and stories, as well as how to morally behave. These things are largely given to the mother to do while the father is out working.\n\nAlthough, history is delegated to the Elders. Ech Arsean village forms a communal teaching centering around Elders who teach younglings about how they came to be, a task given great importance by the Arsean.\n\n## Writing\nMost Arsean knows rudimentary writing and arithmetic, mostly taught by Elders to the young. Although paper has become available recently, most Arsean villagers have no access to paper and thus settled to using clay tablets to inscribe their knowledge and to wood plates using chalks.\n\nCenteal to Arsean culture is the keeping of knowledge hence every community possess a Sacred Wagon containing tablets of their history. During war time, it is forbidden to harm these tablets as doing so could incur the wrath of the gods.\n\nThough in recent years, paper scribes has been going all over Aulmeria, meticulously documenting each village of their Historical Tablets.\n\n# Religion\n## Myth\nCentral to Arsean belief is the [[Great Journey]] voyage by their ancestors who emerged frkm the western continent, home of the demons.\n\n\n## Gods\nThe Arsean worship a number of Gods forming the Arsean Pantheon.\n\n[[Anue]] - Chief Deity of the Arsean. God of Light, Time, and Reality\n[[Anah]] - Wife-Maiden of Annue. Goddess of Speech, Social Spirit, and Mercantile.\n[[Kashu]] - God of Smithing, Artistry, and Hearthfire.\n[[Halzam]] - God of Agriculture, Fertility, Endurance, and Wine.\n[[Eslana]] - Right-hand maiden of [[Anue]]. Goddess of Death, Burials, Rituals, and Silent Solitude. She is the one that presides over the Garde\n[[Miquella]] - Goddess of Music, Warmth, Compassion, and Peace. Originally a goddess worshipped by the Satyrs, she was somehow adopted by the Arseans\n[[Shandor]] - Goddess of Justice, Law, Integrity, and Rightful Retribution.\n[[Fyohr]] - God of Chaos, Change, Mischief, and Revolution.\n[[Ilu]] - God of Destruction, Wind, and Tornadoes. It was Ilu who opposed Annue's Desire to create reality. Patron of Bandits\n[[Theranos]] - Left-hand man of Anue. God of the Underworld, Dreamriver, and Peace.\n\n## Afterlife\nTrading became central to the Arsean way of life. So much that their belief of afterlife is connected to trading. Every trade that an Arsean make counts towards their belief of \"**Uzmot**\", or Life Trade. If they have a sufficiently high Uzmot, they can use it to barter with [[Anue]] for a good place to live in the afterlife.\n\nHowever, those who die without earning enough Uzmot are left in the outer walls of the nether, eating on Meager Grass and flesh bones.\n\nThe following actions results in high Uzmot:\n- Birthing a lot of sons\n- Saving another life\n- Building roads\n- Being a leader/chief/king\n\n# Notable Figures\n\nThe Arsean"}}}, "tags": "", "parent": "races"}