{"areas": {"full": {"tabs": {"default": "The sea satyr, or Alsimyr, are a race of blue skinned, horned race living in the Dragon Archipelago. They posses sea cities and fishing villages and underwater farms. Because of their location, the Sea Satyrs rarely ever go to war with another country due to having no competition within the sea.\n\nThe sea satyr's, however, are currently locked into a civil war against itself.\n\n[[toc]]\n\n# Dragon Archipelago\nThe Dragon Archipelago is a collection of islands in the south-east of loreteia. it is said that in the ancient days, the most powerful [[Leviathan]],  [[Amparous]], was challenged by a certain mortal [[Kyrea|Woman]] who ultimately killed him and ate his body.\n\nThe rest of his bones which fell into the sea became the islands forming the Dragon Archipelago.\n\n# Physiology\nSea satyrs are known for their ability to breathe underwater and the immense strength they posses. Because they cannot use fire, they have learned to use magic to shape things to fit their needs. They also mainly feed on raw meat and vegetables, causing them to have a strange diet. Because most sea satyrs live in the deep ocean sea within the Dragon Archipelago, they posses powerful strength and tough skin.\n\nA sea satyr's receives the blessing of [[Resea]] at the age of five, granting them sight within the darkness of the sea.\n\n# Origin\nThe ancestors of the sea satyrs once live in a continent east of Loreteia. But due to constant war and the destruction of volcanoes within their continent, the ancestors of sea satyrs, who were still known as [[Almatyr]], sailed west together with the [[Keltiks]], the ancestors of [[Celts]].\n\n# History\nWhen the [[Almatyr|Almatyr's]] arrived in the Dragon Archipelago, they found it suitable to their living. The leader of this colony of ancient Sea Satyrs was [[Lagoon the Beloved]], a powerful yet peaceful Archmage Almatyr who seek peace for his people. He followed the goddess Theresia as they sailed west.\n\n# Society and Culture\nThe sea satyr developed a culture which values strength and straight forwardness.\n\n# Religion\n\n# Notable Figures\n\n# Trivia"}}}, "tags": "", "parent": "races"}