{"areas": {"full": {"tabs": {"default": "Eldra, or literally means *Spirit*, refers to beings living within the Abyss and that of the Language spoken in it, which is said to be the language of nature.\n\n[[toc]]\n\n# Language\nAccording to scholars, the direct meaning of the word Eldra is \"Spirit\", however a much more meaningful term according to many scholars is \"One who is part of nature\".\n\nRefer to [[Eldric Language]] for the tongue.\n\n# Characteristics\nEldras (Creature) are characterized by their possession of two hearts in their chest and spiraling etched tattoo in their skin. The other heart is said to be born out of the need to control mana and the spiraling is formed from the way mana moves.\n\n# Behavior\nEldras do not have the ability to defy much more powerful Eldras. They can see Aspects of Nature as naturally as breathing, hence they are subjected to certain laws which mortals are not.\n\nEldras cannot break a promise or oath that they formed, not even Eldradas who presides over the **Aspect of Deception** can break this rule. It is said that it was [[Enderion]] who sets the rules of Nature.\n\n## Primogenitor Inheritance\nSufficiently powerful Eldras may mirror [[Enderion | Enderion's]] [[Soul Severance]] to grant their sponsored beings a fraction of their power [[ref: Odin's Chronicles]]. Once inherited, the sponsor Eldra becomes that being's Primogenitor. The sponsored being can then cultivate this soul fragment and make it grow. The greater it grows, the more powerful it becomes and the power of the sponsored being grows. More importantly, should the sponsored being dies, their [[Primogenitor | Primogenitor's]] soul fragment returns to its original owner.\n\nThe benefit of this sacred act is that for each sufficiently cultivated Soul Fragment, it makes the [[Primogenitor]] much more powerful.\n\n# Types\nEldras are differentiated by their control over an [[Aspect of Nature]].\n* [[Eldrada]] - Spirit Kings. Godlike beings, the most powerful among Eldras.\n* [[Eldrasil]] - Spirit Reaver. Second only to an Eldrada. Their only difference is that an Eldrada has a superior control over an aspect of nature. An Eldrasil is born after usurping the power of a Greater Eldra\n* [[Eldramus]] - Spirit Elders. Naturally born from nature, or created by Eldradas.\n* [[Aeldra]] - Greater Spirit. Strong Eldras.\n* [[Oeldra]] - Minor Spirit. Most Eldras are at this level.\n* [[Ka'Eldra]] - Meaning, half-spirit, refers to changed mortals who became a half-eldra due to circumstances, mostly as a result of being chosen by an Eldrada, turning their body into a form much more suitable at handling their gifted power."}}}}