{"areas": {"full": {"tabs": {"default": "Contain here is the History of Loreteia.\n\nTo Check the history of Earth, check [[Earth History | here]].\n\n[[toc]]\n\nThe history of Mirdum in chronological order.\n\n* [[Eternal Era]] - Approximately 500,000 years ago. An extremely advanced era of magic, science, and technology where gods walk the lands, where masters of sword or magic is as common as grains of sand, and where Madness itself is the air one breaths. Elves, Orcs, Dwarves, and Dragons walked the land. A war broke out as the mortals grew tired of their gods who abuses and treats mortals as mere toys that can be slaughtered on a whim. Time itself was broken and Mirdum was destroyed. [[Artoria]] arose and destroyed most of the gods. A pact was held which made the remaining gods bound to Mirdum in order to fix the broken world. After many years, most of the races from this time became extinct.\n\n* [[Mythical Era]] - Also known as the Great Migration. Races from all over the world conjoined and traveled to [[Loreteia]] to seek new lands. It is the era before the first era where Loreteia is poisoned by Blue Mist, creating a post-apocalyptic civilization.\n* The Ancient [[Arsean|Arseans]], the [[Arkeans]] began crossing the [[Sea of Death]] and arrived in [[Loreteia]].\n* Ancestors of [[Celt|Celts]], the Keltik were riding Sea Dragons together with the ancestors of [{Sea Satyr]] towards Loreteia after their Continent were engulfed in massive volcanoes.\n* Ancestors of [[Light Satyr]], the Dramali, were already settled in Loreteia and were at war with native [[Dravirs]].\n\n* The [[Kyrea|Leviathan Eater]] was born.\n* [[Kyrea]] began roaming Loreteia and slaughtering Leviathans, the remnants of old gods.\n* Together with [[Ursel the Mighty]], an old Arkean Emperor, they killed many Leviathans and their creations.\n* Aulmeria was left uninhabitable for a hundred years and [[Ursel the Mighty]] lost his empire. But not without saving a hundred thousand of his people so that they may populate the lands later.\n* The [[Kyrea|Leviathan Eater]] went to other continents in search of other Leviathans.\n\n# Uknown Era\n** [[UE 1]] - The [[Mad Scholar]] goes on a journey to find the [[Legendary Bloom Doom Shroom]], a legendary bloom jelly ingredient so miraculous it is said to give, \"The Greatest Bloom in all of Existence\".\n** [[UE 1.8]] - The [[Ancient Heroes]] were formed, a rag-tag group of lunatics whom went on a Journey to liberate the lands from evil Eldras.\n** [[UE 2]] - The [[Bloom Lotus Company]] was founded.\n** [[UE 2.5]] - While researching ancient technology, the [[Mad Scholar]] translated the [[Termo Eternalis]] where it detailed research about the Fusion Engine.\n** [[UE 4]] - The [[Mad Scholar]] was fucking around with the Chaos Titan, the [[World Serpent]] and accidentally sent it forward in time before he and his friends were about to kill it.\n** [[UE 4.3]] - The [[Librarium]] was created by the [[Bloom Lotus Company]].\n** [[UE 4.6]] - The [[Mad Scholar]] met [[Lyrea Faust]], an [[Arkean]] woman and helped her research in the study of [[Aspects]].\n** [[UE 5]] - The [[Eternal Tower]] was awakened by the [[Madscholar]], which created a barrier around [[Mirdum]] that protected it from the invasion of [[Eldra | Eldras]]. The land goddess [[Aulindrel]] awakened.\n** [[UE 5.1]] - During the awakening of the Eternal Tower, the [[Mad Scholar]] did a little trolling on [[Anessa the Saint]] and fooled her into thinking she made a covenant with the gods to keep the world safe.\n** [[UE 10]] - [[Lyrea Faust]] apotheosis to godhood.\n** [[UE 15]] - The first [[Shadowfaust]] was born into the world.\n\n# 1st Era\n[[First Era]] - Following the Awakening of the [[Eternal Tower]] by the [[Mad Scholar]], marked the beginning of the First Era.\n** [[1E 203]] - Under the leadership of the [[Golden Scales]], the dravirs, conquered [[Heilgrim]] and Raekirnu, creating the [[Golden Empire]].\n** [[1E 564]] - The Golden Empire fell as the Chief King of [[Heilgrim]] rebelled, creating a massacred of Dravirs all the way to the heart of the Golden Empire. The [[Raekirnu]] people saw the bloodshed political battles brought and their Tribe Father decided that they will not ally with any more race in the future.\n** [[1E 601]] - [[Luna Menur]] allied with [[Sarashi]] while [[Aulmeria]] allied with [[Heilgrim]]. The two empires fought.\n** [[1E 734]] - The alliance between Luna Menur and Sarashi, and Aulmeria and Heilgrim fell to pieces.\n** [[1E 1423]] - The [[Hmner]] race were wiped out because of the trolling that the [[Mad Scholar]] did after he left a note in the translation of the [[Termo Eternalis]] tricking the reader to do an erroneous move which will cause the Fusion Engine to blow up.\n** [[1E 2093]] - The Maddened Sorcerer King, [[Tarnox]] cast a spell which blocked the light of the sun upon the continent of [[Loreteia]], causing the [[Vein of the Fallen God]] to awaken. It was a time where men cannot die and the dead walks everywhere. The [[Lone Warrior]] appeared during this time and liberated the lands by slaying [[Tarnox]] and destroying the [[Vein of the Fallen God]]. WIth countries all over Loreteia destroyed, after this event, it marked the end of the First Era.\n\n# 2nd Era\n[[Second Era]] - Following the destruction of the [[Vein of the Fallen God]], marked the 2nd Era.\n** [[2E 1]] - Alyssandra, the wife of the [[Lone Warrior]] gave birth to a   son, Jeoffrey, who ushered a golden era and became King.\n** [[2E 403]] - The [[Forsaken Ash]] woke up into the world. A being discarded by the god they once served.\n** [[2E 405]] - The [[Forsaken Ash]] successfully defeated [[Albatross]].\n\n** [[2E 1103]] - [[Euphemia | Euphemia the Maid]], a descendant of the [[Lone Warrior]] was born.\n** [[2E 1121]] - [[Euphemia | Euphemia the Maid]], found the [[Ordinary Quill]].\n** [[2E 1123]] - [[Euphemia | Euphemia the Maid]] usurped the throne and became King of [[Ascaron]].\n** [[2E 1131]] - After 8 years of War, Euphemia successfully united all of [[Loreteia]]. A unification feat no one has ever achieved in the continent's history. Euphemia became [[Euphemia]], the Great Conquerer.\n\n# 3rd Era\n\n\n\n"}}}, "tags": "", "parent": "lore"}