{"areas": {"full": {"tabs": {"default": "Marcus Maximus Romulo is the main protagonist of the story [[tie]] and is one of the few Irregular Entities to exists in the entirety of existence. He follows the philosophy of [[Stoicism]] and tries his best to live a Virtuous life. His central principle is to \"Do What Ought to be Done\" and in doing so Marcus does not spare any effort. This exact principle is what led him to traverse entire realities in order to save his friend.\n\nMarcus is the most powerful mortal to ever exists, becoming an true god in every aspect but his body. His sphere of influence is that of Unyielding Will, Absolute Order, White, Potentiality, Stoics, and the Beyond.\n\nAs a regular human, Marcus did not received any gift during the Heaven's Fall and was also never chosen as a Champion, despite possessing all necessary qualities. He has no desire to be on the spotlight and simply wish to peacefully become an Engineer. But circumstances arise that his principles did not allow him to ignore, causing him to go on a journey to save his friends and eventually, become the Elucid King.\n\n\n\n[[toc]]\n\n# Appearance\nMarcus is a humble looking young man, with typical features of a Pilipino, light brown skin, dark hair, and dark eyes. His face is only average looking and his hair is always kept slightly long, with a bangs parting in front of his forehead.\n\nHe has a 169cm height, which is tall by Pilipino standards. As a young child, Marcus never had any problems with his appearance and has always been satisfied with it. When he became a Frost SpiritReaver, his skin, hair, and iris became white and his body, previously skinny, started to grow a very refined muscle. His face also became geometrically balanced causing him to have a better looking face. After giving his powers to Isabelle, his skin was no longer white, but was certainly a lighter shade of brown. His hair became black again but his iris remained white.\n\n\n# Personality\nMarcus is fully aware of his sociopathic side. He finds it difficult to feel empathy for other people. But compelled by his philosophy, he began acting kind and good towards others because it was the right thing to do. \n\n\n# Godhood\nMarcus is a genuine god, whose sphere of influence is that of Unyielding Will, Absolute Order, White, Unbreakable Endurance, Potentiality, Stoics, and the Beyond.\n\nWhen people pray to him or invokes his sphere, the can truly feel his presence and his blessings. As a being who had seen the Beyond, Marcus possessed abilities that would make him no weaker than other [[Eldrada]].\n\nHowever, due to Marcus' adamant Will to stay as a mortal, he did not ascend to godhood and his body remained mortal. This in turn began to birth an entirely unique god that is both immortal and mortal.\n\n# Abilities\n- **Existence Manipulation** - As a fully fledged Irregular Entity, from the very beginning of the story, Marcus has been fully capable of rewriting, manipulating, and reshaping existence itself. He can change reality to however he wishes, he can erase anyone from history, and make something that isn't always has been. He can also manipulate and touch \"Concepts\" itself and intrude into other aspects of reality. Nature itself exist below him and Marcus is capable of fully destroying and recreating it, as well as the entirety of existence. He can manipulate time and space, and travel whenever and wherever he wants. He can also manipulate souls and everything that exists between the borders of reality and fantasy. Existence itself is the \"dream\" of Marcus Romulo, the Amaranth, hence he can change it freely to whatever he wants. But all of this puts a risk of causing Marcus to [[Zero sum]]. Because of his rejection of his true nature, he refuses to use his power and thus if he carelessly use it, he can accidentally Zero sum himself, by his own power.\n\n\n\n\n"}}}, "tags": "", "parent": "tie-characters"}