{"areas": {"full": {"tabs": {"default": "An **Irregular Entity** is a being that exist outside of [[Nature]]. They are beings who had seen [[What Lies Beyond the Horizon]] and had not lost their sanity.\n\n[[toc]]\n\n# Known Irregular Entities\n- [[Marcus Romulo]]\n- [[Enderion]]\n- [[Artoria]]\n\n# Origin\nIn the entirety of existence, it is said that every being that exists is but a manifestation of the Creator's life, an avatar representing a fragment of his consciousness. Therefore there are no actual being who exist other than the creator. An Irregular Entity, however, is an existence which broke away from the Creator and became a separate existence on it's own. its an entity which woke up from the dream, and as Nature tried to erase them from existence and correct what was wrong, they succeeded in \"Willing themselves back into existence\" and thus continuing their life, completely severed from the threads of destiny, history, or from the intervention of any divine beings.\n\nAn Irregular Entity is usually born through a great deal of adversity, They are very egoistical and extremely prideful beings who self-asserted themselves into existence, beings who possess an extremely powerful will to declares themselves  as **Existing** despite the adamant truth that they do not.\n\nIrregular Entities are almost always practitioners of Stoicism or any similar philosophies or mental techniques due to it's ability to give it's user a powerful metal fortitude.\n\n# The Beyond\nWhen an being starts becoming an Irregular Entity, they will get a complete view of the [[Beyond]], filled with nothing but pure absolute concepts of reality, this would usually drive them completely insane and erase their existence from reality. But if the person is sufficiently prideful enough to declare themselves as existing, they come back to existence and now has the full capacity to go to the Beyond whenever they want.\n\n# Abilities\nAn Irregular Entity, due to being an existence that **Woke up from the Dream**, is now fully capable of Altering it to however they wish. They now possess complete, omnipotent and omniscient power to rewrite time, destiny, and alter the laws of reality and even sever history to however they wish.\n\nAn irregular entity that denies their true nature, however, risks [[Zero-Sum]], an act which causes them to personally rewrite their existence out of reality as a consequence of their denial, as what Marcus Romulo did."}}}, "tags": "", "parent": "beings"}