{"areas": {"full": {"tabs": {"default": "Kyrea, is a legendary being known only in myths as the Leviathan Eater, Leviathan Slayer, the Predator of Unkillable beings, She-who-predates-on-Leviathans.\n\nShe is responsible for singlehandedly almost bringing the Leviathans to extinction.\n\n\n# Leviathan Warring Era\nIn an age where the Children of Kos arose from the depths of the Ocean, they ruled the land as living gods. Some were benevolent, but many were despotic and used mortals as mere toys. Bloated and titanic beings called [[Leviathans]], they were the peak of magic and closest to nature. As the children of kos, they seek to return back to the Aether and retake every [[Spark]] from mortals.\n\nThey were beings who participated in the creation of [[Mirdum]] but were left behind and buried.\n\nDuring this time, a legendary being known as the [[Leviathan Eater]] arose. An impoverished girl from the streets of Lordan arose from a life of destitute and rose to greatness by hunting Leviathans and eating them. She became the only known predator of Leviathans.\n\nHer name was lost in history, but she was once called [[Kyrea]]. Lost and thrown into the forbidden forest to die, Kyrea, a young 12-years-old girl was starving to death. She wandered the forest, hiding from every monster that wants to kill her. Eventually, she saw a sleeping Leviathan, a being of great terror. But the hunger within [[Kyrea]] overwhelmed her fear, and seeing that the Jellytanous Leviathan slumbered, she made the craziest decision of trying to eat it.\n\nThe Leviathan [[Krossh]] saw the little girl approach his slumbering den only to steal a small part of his flesh before retreating back. Seeing as it was nothing but a fragile girl, he scoffed and went back to sleep.\n\nBut at that moment, his action had ultimately sealed the fate of the Leviathans. \n\n[[Kyrea]] ate his flesh. Initially it caused so much pain and suffering to Kyrea that she wanted to die, but the distant memory of her mother and father pushed her forward that she endured through the pain. She woke up realizing she had grown stronger and that her hunger disappared.\n\nAnd so, throughout the years, [[Kyrea]] would eat small parts of [[Krossh]], using it as nourishment for her growing body, not realizing that the pure and powerful mana and aldric spirit she's eating is changing her body.\n\n[[Krossh]] did not put any guard up, but simply kept sleeping as he believed nobody could hurt him, unware that after ten years of sleeping, [[Kyrea]] had grown so powerful from devouring him and destroying many powerful beasts within the forest.\n\nSometime of these years, [[Kyrea]] would find a dying wizard who had passed on his legacy to her. It was a magic that could open a link to Aetherium so that men could flee from [[Mirdum]]. But Kyrea was uninterested in fleeing as she manipulated the magic, turning it into a way to channel energy from Aetherium. Combined with her completely changed body that was no longer human, Kyrea became extremely powerful.\n\nAfter defeating every monster within the [[Forbidden Forest]], Kyrea deliberately woke up [[Krossh]]. And in his sudden wake, he had received a terrible slash from Kyrea, deeply injuring him.\n\nA battle occurred which shattered and completely destroyed the [[Forbidden Forest]]. After seven days and seven nights, Kyrea would emerge victorious. But she did not kill [[Krossh]]. She simply stood on top of him and kept devouring him.\n\nKyrea kept going back to his body and would eat and eat until after one year there was nothing but the heart of [[Krossh]] left. Kyrea also devoured this, granting her the power of a Leviathan.\n\nAnd so, she left the [[Forbidden]] forest. And in the next decades, Kyrea liberated every mortal from the clutches of the [[Leviathan|Leviathan's]], almost hunting all of them into extinction.\n\n\n"}}}, "tags": "", "parent": "beings"}