{"areas": {"full": {"tabs": {"default": "Agnis Kraus is one of the central characters from [[tboah]] and the home room teacher responsible for [[e-class]]. She possess a dual personality, consisting of the meek and shy **Agnis** and the strong and bold **Agatha**.\n\n[[toc]]\n\n# Appearance\nAgnis is a very beautiful woman with blonde hair and blue eyes. She possess a sexy body with large breast and a curvaceous hips. As Agatha, however, her hair turns into white and her eyes turns red.\n\n# Personality\nAs Agnis, she is a meek and shy woman, always being clumsy and easy to get distracted. She is also very sweet, kind, and cheerful to those around her. But as Agatha, she is very brave, fearless, and bold, unwilling to compromise on what needs to be done. She is often serious and glares at her students.\n\n# History\nAgnis and Agatha, in reality, were twins inside their mother. But due to a miscarriage, Agatha died in the womb and was absorbed by Agnis. Hence when they were born, only Agnis came out.\n\nAs a child, before Agnis awakened, her parents would always watch her play around as if there's another person in the room. Thinking it was just a toddler's imagination, the parents ignored it. But it was when Agnis became 5 years old when her powers awakened and Agatha came out, taking over Agnis' body.\n\nIt was then revealed that although Agatha died in the womb, Agnis did not just absorbed her body but also her soul and her power, creating a chimera human with two souls inside of it. It was then found that Agnis did not possess any powers but it was Agatha who did, hence she can only use her powers if Agatha took over. \n\nDue to Agnis having a meek personality, Agatha became the stronger of the two and would always come out to defend her **Little Sister**.\n\n# Ability\n* [[Ghost Hands]] - The ability to manifest ghostly hands. It appears that only [[Agatha-kraus]] can use this."}}, "preview": {"tabs": {"default": "Agnis Kraus is one of the central characters from [[tboah]] and the home room teacher responsible for [[e-class]]. She possess a dual personality, consisting of the meek and shy **Agnis** and the strong and bold **Agatha**.\n\n[[toc]]\n\n# Appearance\nAgnis is a very beautiful woman with blonde hair and blue eyes. She possess a sexy body with large breast and a curvaceous hips. As Agatha, however, her hair turns into white and her eyes turns red.\n\n# Personality\nAs Agnis, she is a meek and shy woman, always being clumsy and easy to get distracted. She is also very sweet, kind, and cheerful to those around her. But as Agatha, she is very brave, fearless, and bold, unwilling to compromise on what needs to be done. She is often serious and glares at her students.\n\n# Ability\n* [[Ghost Hands]] - The ability to manifest ghostly hands. It appears that only [[Agatha-kraus]] can use this."}}}, "tags": "", "parent": "tboah-characters"}