{"areas": {"full": {"tabs": {"default": "Within the world of [[Mirdum]] the common practiced religion is the 12 divines and its variations from cultures to cultures.\n\n[[toc]]\n\n# Aldrim Gods\nAlso Known as the 12 Divines. They are the ancestral gods who helped in creating [[Mirdum]].\n* [[Aeolius]] - God of Wisdom, Logic, and Philosophy\n* [[Hoven]] - God of Life, Wind, and Nature.\n* [[Jorngell]] - God of Smithing, Artistry, and Hearthfire.\n* [[Halbert]] - God of Agriculture, Fertility, Endurance, and Wine.\n* [[Yngdall]] - God of Mercy, Light, and Natural Order.\n* [[Fyohr]] - God of Chaos, Change, Mischief, and Revolution.\n* [[Shane]] - Goddess of Justice, Law, Integrity, and Rightful Retribution.\n* [[Miquella]] - Goddess of Music, Warmth, Compassion, and Peace.\n* [[Emilia]] - Goddess of Love, Kindness, Beauty, and Romance.\n* [[Annahria]] - Goddess of Education, Speech, Commerce, and Mercantile.\n* [[Theresia]] - Goddess of Sea, Water, Healing, and Flow.\n* [[Dianna]] - Goddess of Death, Burials, Rituals, and Silent Solitude.\n\n# Oldrim Gods\nThe gods who did not participated in the creation of [[Mirdum]].\n* [[Parthinus]]\n* [[Theranos]]\n* [[Pavlos]]\n* [[Morten]]\n* [[Arbita]]\n* [[Khione]] - Goddess of Snow, Healing, and Beauty\n* [[Eragon]]- God of Earth, Endurance, and Trees\n* [[Hestia]] - Goddess of Fire, Change and Temperance\n* [[Yngell]] - God of Water, War, and Combat.\n* [[Vulcan]]- God of Strength, Hardship, and Courage\n* [[Mephismer]] - God of Forbidden Knowledge, Libraries, and Horrors\n\n# Primordials\nPrimordials are **true** gods. Beings who are truly part of nature, who is the ACTUAL aspect of nature, embodying it in truest sense. However, most primordials have no ego as becoming a true part of nature means losing it. Only a handful of Primordials kept their ego, in some special way or another.\n\n* [[White God]] - White, Absolute Order, Unyielding Will and the Beyond.\n* [[Fygnell]] - God of Madness and Rationality,\n\n\n# Ascended Beings\nSome mortals, through their understand of Nature's Mystery and her Aspects, manages to see [[the Veil]] and in turns sheds their mortalhood and ascends to a higher being.\n* [[Shadow Mother]] - Goddess of Shadow Protection, Cunning Deception, Ruthless Vengeance, and Protector of Children.\n\n\n# Cultivated Beings\nSome mortals, however, does the opposite of Ascension. They do not shed their mortality, but fully embraces it and manually cultivates their own \"Nature\" within their soul, with its own Aspect and Reality, eventually becoming a sufficiently omnipotent entity.\n* [[Artoria]] - God of Time"}}}}