{"areas": {"full": {"tabs": {"default": "**Author**: Faolagan Slanei\n**Category**: Myths and Religion\n**Archived by**: Bardin the Handsome\n**Librarian Comment**: I had to steal this from an old woman just to get a copy. Why in the bloody hell are Celts so damn protective of their literature? Don't they want the world to know it? Knowing those barbarians, they'll most likely just burn everything down to ashes. Heck, the author of this book ISN'T even a celt, goddamnit.\n\n**Book Content**:\n\nDedicated to my Celtic People.\n\nMay the light of the Owl guide you. And may the Eternal Veil Prevail.\n\nThe Celts are by nature, very religious people. At the core of our values is *Family* and we believe that the gods are our ancestors who bleed so that we may live, toiled so that we may have home, cried so that we may be protected, and fought so that we may grow. We are descendent from our gods, the Ourdanous, the Ancestral Parents. As I write this, our ancestral parents are sacrificing parts of themselves to sustain the world so that we may be able to breath.\n\nAs such, each and every single one of us has a duty to revere and give our payment to our Ancestral Parents, so that we may ease their burden, albeit a little.\n\nThe following are the Ancestral Parents that all Celts commonly worship. I have had difficulty organizing these, as each region of Heilgrim had their own variant interpretation of our Ancestral Parents, and some even worshipping the same god with two different personification that are all the same! Alas, after careful study and consideration with \"other\" scholars, I have surmised these as best as a I could to be the most accurate.\n\n**The Chief** - Who represents the greed of mankind and its redemption.\n**The Owl** - Who represents the madness of wisdom and its freedom.\n**The Bear** - Who represent savagery of the life and its beauty.\n**The Armado** - Who represents the brutality of smithing and its power.\n**The Wolf** - Who represents the loneliness of protection and its necessity.\n**The Eagle** - Who represents the ferocity of light and its kindness.\n**The Dragon** - Who represents the necessity of chaos and its truthfulness.\n**The Serpent** - Who represents the wickedness of justice and its humbleness.\n**The Canary** - Who represents the simplicity of music and its compassion.\n**The Butterfly** - Who represents the cruelty of love and its fortitude.\n**The Dove** - Who represents the cunningness of speech and its price.\n**The Fish** - Who represents the strength of the sea and its gentleness.\n**The Vulture** - Who represents the goodness of death and its peacefulness.\n**The Ferret** - Who represents the slyness of reason and its mischief.\n\nAlthough other races may give our Ancestral Parents a name, we do not do so. We must remember that we do not call them from the names of animals to demean them, but to remind us that our Ancestral Parents are a part of nature and they are part of the world we live in. They exist with us on our everyday life. Through their conduits, they see us, feel us, hear us. Hence we must always act in accordance to their will. For only by doing so can we repay them of our depth of gratitude.\n\nMay we all die with honor, and may we feast together in Valhool."}}}}