{"areas": {"full": {"tabs": {"default": "**Author**: Indeterminable\n**Category**: Myths and Religion\n**Archived by**: Thales of Milletus\n**Librarian Comment**: This was a short book translated from the Forgotten tongue by the Light Satyrs. Interestingly, this particular copy shows no signs of erosion or damage regardless of whatever we hit it with, physical or magical. As such its impossible to determine the age of this golden book. Because of its invulnerability, I even used it as a cannon-ball to kill a chaos titan. It's very effective I tell ya.\n\n**Book Content**:\n\nIn the beginning, among the ashes of those that came before, arose a single being.\n\nEnderion.\n\nWith his Hammer and the Eternal forge, Enderion crafted all of reality.\n\nThe first hit of the hammer, Space was born.\n\nThe second hit of the hammer, Time was born.\n\nThe third hit of the hammer, Matter was born.\n\nThe fourth hit of the hammer, Stars were born.\n\nThe fifth hit of the hammer, Galaxies were born.\n\nThe sixth hit of the hammer, Planets were born.\n\nThe seventh hit of the hammer, Dimensions were born.\n\nThe eight hit of the hammer, Ideas were born.\n\nThe ninth hit of the hammer, Life was born.\n\nBut Enderion witnessed the life he had forged from the ninth hit. And he felt pity, for they moved, but they have no mind. They eat, but they could not taste. They see, but they could not react.\n\nAnd so Enderion took a piece of his soul, placed it within the Eternal Forge, and hit it with his hammer.\n\nThe tenth hit of the hammer, the Souls were born.\n\nAnd from the largest fragments of his soul, the gods arose. From the tiniest pieces, the mortals were born. And from the soul fragments of Enderion whom were shaded with darkness, the Eldritch were created.\n\nAnd when his children kneeled before him, begging for an answer for why they were born, Enderion was silent. And then he replied.\n\n\"Seek the meaning of Existence\", and so on the tenth and last hit of his hammer, Enderion rested within the canvas. Comforted by his Left, and his Right.\n\nHe saw the Entirety of existence that he created, and he was satisfied."}}}, "tags": "", "parent": "myths-and-religions"}