{"areas": {"full": {"tabs": {"default": "**Author**: Althaus Creed\n**Category**: Myths and Religion\n**Archived by**: Mila Frostsword\n**Librarian Comment**: The most mysterious of all gods. The White God. This was a book that Althaus himself personally gave me to be archived by the Librarium. It is the culmination of his life's study. He is a reclusive man and the greatest scholar in the study of the elusive god. But dare I say, something about him feels wrong. He acts very rational, kind, and polite, but somehow, something tells me, whenever I look in his eyes, that there live a completely insane man. Perhaps this is the effect of studying such a dangerous god. I have heard tales of the dealings with the White God. And if any future reader would wish to conduct such negotiation, I highly suggest for you to seek an **Oldrim** god than the White God. I cannot emphasize this enough.\n\n**Book Content**:\nThere is the Aldrim, whose benevolent existence keeps Mirdum in order. There is the Oldrim, whose malevolent existence keeps Mirdum in constant flux. And then... there is the White God, whose existence seems to serve no other purpose than the ABSOLUTE correction of a single minded goal.\n\nTo discuss the White God, I must first discuss the dichotomy between Aldrim and Oldrim.\n\nAccording to myths, the Aldrim gods, or known as Eld'radiya in Eldra, are beings existing in a higher plane of existence, whose bodies and soul are melded with Mirdum as a consequence of it's creation. The exact details can no longer be known, but it is said that before time was born, there was nothing but chaos, and the Dragon was born, who created Mirdum and Time, and saved the Aldrim gods by mending their broken realms with Mirdum.\n\nBut saved? Saved from what? We do not know.\n\nAnd the Oldrim gods are the Eld'radiya who had not been saved by the Dragon. Who took a step back and hid within the void, and when the Light of the Dragon dawned into the Abyss, they appeared and participated in the shaping of Mirdum.\n\nBut hide? Gods hiding? From what?  We do not know.\n\nAnd from these notions, we understand that Aldrim and Oldrim are nothing but distinctions created to differentiate between our Ancestral Gods who are part of our world and gods who are not our ancestors, who still freely shape our history and destiny. The two arose from the same thing, they are both Eld'radiya.\n\nBur what is the White God?\n\nIt is not an Eld'radiya. It has no realm within the Aetherium, it has no \"Sphere of Influence\", as you would speak of, say, Akyone whose sphere of influence is Summer, Snow, Beauty, and Healing. You cannot communicate with it, not as how we communicate with gods by offering gifts, a sacrifice, or by invoking them in the day and time of their naming. No, you cannot even speak with it! It has no voice, no name, hence we call it the White God.\n\nAnd so, if it has no sphere of influence, no name, and cannot be communed with mortals, what exactly does the White God serve?\n\nIt is a being which favours fanatics.\n\nIn every culture, and in every society of every myths, even murals dating back to Elvish ruins, I have seen what I believe were evidence of the White God's existence.\n\nBut it is not worshipped by the people, as what would conventionally be done by them to any gods, even to the evil gods.\n\nNo, there is only one specific group of people who will, and can worship the White God.\n\nGreat Men.\n\nOnly Great Men and Women, Heroes, Legendary beings, a person who MUST absolutely accomplish a goal!\n\nAnd what do they receive in exchange of worshipping the White God?\n\nNothing!\n\nThat's right, nothing!\n\nWhat? Is that even a god? Even I was baffled. I did not understand it. I could not comprehend it. So I had to study. I've read through many scrolls, went through many ruins, and even studied the oral teachings passed down by elders to their pups. And I have come to the conclusion.\n\nThe White God grants an unbreakable Will! That's it.\n\nIt grants you nothing else. No magic, no strength, no power. It simply will not let your will be broken! The condition is that you must not give up, and must not lose your will. Do this, and the white god will keep your will unbreakable. But should you fail in this, you will lose your sanity and you will kill yourself.\n\nWhat even is the point in this deal?\n\nI do not know. Isn't such a thing achievable by a mere Mystic Spell? And yet, every hero, of every age all takes this deal.\n\nAnd none of these heroes fail.\n\n\n\n\n\n\n \n\n\n\n\n\n\n\n"}}}, "tags": "", "parent": "librarium"}