{"areas": {"full": {"tabs": {"default": "**Chapter 1 — Choices (1)**\n\n> \"A man cannot become a Hero until he can see the root of his own downfall\" — Aristotle\n\nAll men are not created equal.\n\nI didn't grasp those words until I was five-years-old, when I was beaten back in kindergarten. \n\nIn this world, the lack of a Psionic power is the same as a disability. Unlike other kids who already awakened, it was two years later before I got mine. It's no wonder I was the constant target of bullying. \n\nEspecially with that blonde kid and his gang.  He could crystallize light into powerful crystal-light gloves, while his friends could wield electricity and release explosive bubbles from their hands.\n\nMy parents instilled in me the value of protecting the weak. So, when they targeted a classmate with a lesser power, I couldn't stand by and intervened.\n\nIt didn't go as planned. \n\nA boy with dark hair and striking orange-red eyes lay on the playground dirt, gazing up at the bright blue sky.\n\nThat was me.\n\n\"Ha! That showed him!\"\n\n\"Stupid Ethan! Should've just stayed down\"\n\n\"Hey, I have the new Soga game! Let's try it\"\n\nThe sand's heat, my bruises' pain, buzzing insects, and playground's reflection all surrounded me. But lying there, a sudden question arose in my mind.\n\nWhy do I need a superpower to defeat anyone?\n\nMy eyes opened wide as I realized.\n\n\"… I don't need to\"\n\nAnd at that moment, I made an irrevocable choice, a choice which will dictate the course of my life. But I was too young to know better.\n\nI stood up and wiped the blood off my face.  As the three of them walked away, I picked up a dozen rock from the ground. \n\nAnd started throwing rocks.\n\n\"Aghh!\"\n\nI hurled rocks, one after another. When they charged at me, I sprinted away. Unlike them, I hadn't awakened my power, so I became the fastest kid in class. I used to be the one laid on the dirt.\n\nNow it was them. \n\nI stood up, watching them writhe in pain. They were battered, bloodied, and one kid's eyes were bulging.\n\n\"Enough. Ethan, we won't hurt you anymore… uwahh!\"\n\n\"Mommy!\"\n\n\"Kugh… you powerless… weakling!\", the blond-haired kid grimaced.\n\nWithin those very moment… the innocent five-years-old me suddenly woke up to a strange feeling. The feeling of dominating other people.\n\nIt felt good.\n\nThey still irritated  me, so I  kicked them in the face and stomach. Thinking back, I was quite the merciless little psychopath. Even as they beg and coughed blood, there was no stopping me. \n\nWhen the  parents finally arrived, they had to forcibly drag me away, as I continued hurling stones from a distance.\n\nThose memories… it flashed through my head.\n\nBecause that, was the first time I won against my best friend.\n\n\"…w… k… p\"\n\nThe first time we were on equal grounds…\n\n\"Wa…ke… p\"\n\nAnd the beginning of our brotherhood.\n\n**\"WAKE UP YOU PIECE OF SHIT!\"**\n\nThe shout woke me up back to reality. The bleakness of the night shined into my eyes. Smoke and ashes lingered everywhere as the bloody shade of heat and fire made my skin… shiver. I breathe roughly, my arms bleeding, and my eyes, tired and a blur.\n\n**\"So, which one is it? Hehehehe\"**, a voice with pure malice… it itched my ears like harrowing drums.\n\nI was shaking. Afraid. \n\nNone of my powers worked.\n\nAll my training, all my fighting… worthless.\n\n**\"Come on, Ethan…\"**\n\nThat thing. It was a being shrouded in darkness, with an ebony, skeleton-like body, covered by a layer of chitin. It held a golden-haired boy in its left and a brown haired, unconscious girl, in his right. Both were bleeding. Dying.\n\n**\"Which one is it? The boy? Or the girl? The Best Friend? Or the love interest?\",** The strange anthropoid entity madly asked. I grasped  the pistol again, trembling, shivering. In my line of sight, I saw the cold bodies of my mentors. Ripped to pieces. I raised the gun, pointing at him. My brows creased. Mouth turned upwards. Eyes blurring.\n\n\"… Haah… Hah….\",  even as I aimed the gun, I knew it was futile.\n\nI don't know what to say, nor what to think.\n\nHe offered me a choice.\n\nOne, impossible to make.\n\n**\"Come on!\",** the entity's dark and deep voice echoed.\n\n**\"PICK! WHICH ONE?!\"**\n\nHe tightened his grasp on the boy's neck.\n\n**\"THE LEFT?! THE LIGHT CHILD?!\"**\n\nAnd then the girl's neck too.\n\n**\"THE RIGHT?! THE HEALING CHILD?! WHICH ONE?! PICK GODDAMMIT!! WHICH FUCKING ONE?!!?!\"**\n\nThat thing stared right through my eyes. His red eyes, flashed with madness and lunacy.\n\n\"**PICK!! WHICH ONE ETHAN?! MAKE THE CHOICE!! HAHAHAHAHAH\"**\n\nAs the Entity became more and more deranged, drowned by the rabid excitement of Madness, I, too, began to feel myself... slipping away.\n\n\"E…than…\", my best friend bemoaned.\n\n\"Choose her… choose Vanessa… Choose her!!\", Kevin shouted in anguish. Painted on his wide hollowed eyes were the color of despair. As I stared into those terrible eyes…\n\nSomething broke within me.\n\nI turned stiffly towards him. My eyes, blank.\n\n\"Eth…an… do it… d… it…\"\n\nAnd I…\n\nI made the Choice.\n\n\n◇ ◇ ◇ ◇ ◇\n\n\nA year passed.\n\n6:43 AM \n\n\"Ethan! You're going to be late for school!\", a woman's voice shouted from the kitchen.\n\nMorning light entered into the aging room, highlighting dust motes, peeling paint, and cracked windows. The room was a chaotic jumble of junk, gadgets, books, weapons, and various materials, leaving little space to move.\n\nAnd before the door, a boy peacefully slept.\n\nA holographic laptop stood in his desk. On the blackboard to the wall were all kinds of mathematical and chemical equations, alongside numerous atomic structures.\n\n\"Ethan! It's seven already!\", the voice hurried, \"Isaac, go wake your brother\" \n\n\"Oh, okay mom\" \n\nThe door swung open, and an adorable eight-year-old boy entered. With dark, curly hair and striking orange-red eyes, he wore a white morning shirt. The little boy approached the large heap of fabric on the floor and gave it a shake.\n\n\"Big bro, wake up! Wake up!\" \n\n\"… Ugh… five more minutes…\" \n\n\"Big bro, isn't today your last day of middle school? And mom's going to get mad!\" \n\n\"… Ughhh… Fine…\" \n\nEthan sluggishly woke up. His little brother chuckled, thinking he was like a wobbly jelly. \n\n\"Come on big bro, you only have fifteen minutes left!\" \n\n\"… Uhhhh… o, okay\" \n\nEthan slowly got up. Led by his little brother's hands, he was pushed to the bathroom.\n\n\"Now go, clean yourself up!\", Isaac directed, filling his toothbrush for him.\n\n\"Isaac, it's your favorite TV show\", their mother announced, the sound of dishwashing coming from her direction.\n\nWith a bright look in Isaac's face, he rushed to the living room.\n\nEthan scrutinized himself at the mirror. Pitch black haired, orange-red eyes with a few bags underneath. A sandy beige skin tone, and a slightly above average face. \n\nEthan had an average body, neither thin nor buff. Under his orange-red shirt, hard muscles were developed. \n\nAfter washing, he saw their small living room. It was a bit cramped, with a sofa facing the TV, the kitchen just two meters from it, and a small 4×4 meter space just before the door outside.\n\nHis beautiful mother raged at him for being such a slowpoke. But as he dried  his hair with a towel, he saw how his mother casually picked up a chicken nugget, directly from the boiling oil. \n\n\"… the hell. Mom, be civilized. Use spatulas\" \n\n\"It's a lot faster this way\" \n\nHis little brother was immersed on the television. It played a cartoon series based on the currently most powerful hero in the world. \n\nUnion Prime. \n\nA tall, handsome man donning a blue armored suit with a red cape. His well-toned body displayed impressive muscles. He was known as the Symbol of Peace.\n\n\"There's nothing to worry about! For I, Union Prime is here!\", the kid's show went on with Union Prime showing his super strength, super speed, super reflexes, and flight.\n\nLittle Isaac began cheering, but Ethan simply held a pair of half-closed eyes.\n\n'_… So uncreative_.' \n\n\"Ethan, why are you still in your bath towel? Go change now!\" \n\n\"… Yes, yes\" \n\nHe entered his room changed into his dark Junior High school uniform. Casually, he picked a strangely angled ring placed in front of the mirror. Ethan then looked for his glasses, only to see that it was Crushed by one of the metal ingots. \n\n\"… Oh…\", he sighed before throwing it away.\n\nEthan opened his right palm. He concentrated for a moment and, a new rounded glass came out.\n\nAfter wearing it, he lightly smiled.\n\n\"… Good\" \n\n\n◇ ◇ ◇ ◇ ◇\n\nIn the bustling City of Artem, skyscrapers, intricate rail lines, and towering trees framed the urban landscape. The air buzzed with rising smoke, flying cars, and drifting airships adorned with screen ads. Amid the morning commute, Ethan sat on the crowded train, engrossed in watching a video in his smartphone about a legendary figure from two hundred fifty years ago.\n\n'_… The ElucidKing… a man with no powers at the beginning, who acted as the leader of the Heroes and led the fight against the Invasion of the Abyss. A man of Great Virtue and Character. Undoubtedly the King of this World._'\n\nIn the video, the man stood confidently before a group of trembling villains and otherworldly beings.\n\n_\"… I'm just a regular Human\"_, the dark haired man with White eyes grinned, _\"… Why are you guys so afraid?\"_\n\nEthan felt his skin hair rise up.\n\n'_… No matter how many times I see it, it still makes me shiver…_', but he sighed afterwards.\n\n'_… If only he did not disappear sixty years ago…_'\n\nFixated on one of the train's wall was s a holographic screen. A female news reporter started announcing.\n\n\"Ten months have passed since the cruel and violent vigilante, Unchained Predator, a powerful Cryomancer and Telekinetic, went on a rampage and slaughtered hundreds of criminals. To this day, no one still know who or what he is…\"\n\nAs he browsed the internet, Ethan felt a sudden tremor, the sound of explosion.\n\nTurning to the train's window, his eyes widened. Flying through the sky was a man with dark, large wings, wearing a black armored suit. He carried a certain box. Behind him were rows of explosion one after another. \n\nAnother man appeared, wearing a green jacket and short pants, he gigantified, growing into a fifteen-meter tall giant. A wave of his hand toppled a building, causing chasing heroes to stop. \n\n\"Woahh! Another again?\" \n\n\"Damn, what about the people inside those buildings?\" \n\n\"Villains sure are appearing a lot lately\"\n\n\"Look, it's Electric Falcon!\", the distraught was suddenly replaced by cheering.\n\nA man with white wings, sporting a falcon-like helmet and sleek leather armor, soared like the wind. He delivered a powerful blow with his golden glove to the giant's forehead, unleashing a burst of intense yellow lightning.\n\nThe giant  lost consciousness, tumbling toward the ground. But just before impact, a figure cloaked in dark robes emerged from the shadows. With an eerie gleam in his eyes, he conjured a shadowy light, causing the plummeting giant to hover midair, averting further damage to the ground.\n\n\"Oh!! Its Dark Caster!\" \n\n'_… A-Class Heroes?_', Ethan lightly frowned.\n\n'_They must be in deep shit to move these guys out._'\n\nThe dark winged man gnashed his teeth. Tightly, he hugged the box and accelerated forward.\n\nHe retrieved a cube from his pocket and flung it to the ground. Landing at a city road intersection, it instantly expanded and transformed.\n\n\"What, what the hell is that?\" \n\n\"Is that a monster?\" \n\n\"Run away!\" \n\n\"ARGhh!\" \n\nScreams erupted and the people fled.\n\nEthan wanted to watch but the train already left. Returning to his phone, he quickly followed the livestream.\n\n'_… Monster summoning cube. A nasty piece of technology that's been developed by terrorist organizations east of Ostania_.' \n\nIn the footage, Electric Falcon and Dark Caster had to stop.  They prioritized saving the people from the rampaging, bull-headed tri-pedal monster carrying a writhing stone hammer.\n\nThe drone livestreamed the battle. \n\n\"Dark Caster!\", Electric Falcon shouted. \n\n\"Got it!\" With a swift response, Dark Caster's cloak expanded, engulfing the bull-like monster. Despite its struggles, the shadow's grip tightened. Dark Caster extended his shadow, guiding all civilians away from the scene.\n\n\"I'm Sorry!\", Dark Caster shouted as he tossed people aside.\n\n\"Die!\" Electric Falcon yelled, a metallic pile driver emerging from his right forearm and piercing deep into the monster's head.\n\n\"Electric Shock!\" An electric wave surged through the monster's brain, instantly ending its life.\n\nWith half-closed eyes, Ethan couldn't resist commenting, \"Seriously, dude, you need more creative names.\"\n\nDark Caster carefully lowered the lifeless monster to the ground.\n\n\"Falcon! Spot him?!\", Dark Caster scanned the sky, whose silhouette is marked with a faint hexagonal grid pattern.\n\n\"No, he got away!\"\n\n\"Damn it! HQ, this is DC, we need eyes!\"\n\nThe livestream continued, and it showed the two leaving the scene.\n\nAround Ethan, many people were also watching in their phones. \n\n\"Damn! Those are A-Tier Heroes for you!\" \n\n\"Absolutely cool! I wish I was like them\" \n\n\"Man, my superpower is just a week earth skill\" \n\n\"I wonder when Electric Falcon 2 the movie will be released?\" \n\nAs the heroes left, Ethan continued watching the livestream. With no main characters, most no longer paid attention.\n\nHe witnessed the cries, the pain, the death. Moments later, the ambulances and minor heroes arrived to help.\n\n'... I'm grateful I live in Arlika', Ethan thought.\n\n'... A first-world nation with an excellent internal defense force system. Because in many poorer nations… such luxury…', he creased his eyebrows.\n\n'... Does not Exist.''\n\n\n◇ ◇ ◇ ◇ ◇\n\n\nThe classroom door opened, and a dark-haired boy with orange-red eyes casually entered. As he sat in the middle, everyone in the room looked at him, some with smirks, others with mocking glances, and most with indifference.\n\n\"Ethan Morales, you're late again!\",  the teacher shouted. He was a tough and muscular man, brown skin with sharp eyes and spiky black hair. \n\n\"It's the final day of school, and you're still late?\", the teacher sighed, glaring at Ethan.\n\n\"… Yeah\", Ethan simply nodded, with blank empty eyes.\n\nThe teacher momentarily stared before heaving a sigh. A crease formed in his eyebrows.\n\n\"Alright, for this last day, I'm going to be giving a final future career advise individually. But….\" \n\nEvery kid in the room suddenly exhibited their psionic abilities. Some conjured wood, others extended their arms, some sprouted sharp claws, and others developed tail-like appendages, and so on.\n\n\"You're all going to try for the Guardian schools I see\", the teacher bitterly smiled at the enthusiasm of his students. \n\nMany students came and go. After a while passed, it was Ethan's turn. \n\nWithin a private classroom, Ethan sat before his homeroom teacher.\n\n\"Ethan…\", his teacher awkwardly smiled, \"Are you serious? But with your superpower\" \n\n\"… Yes…\", Ethan lightly smiled, his eyes were without any expression \"… I will succeed… That's guaranteed\"\n\nThe teacher stared deep into Ethan, his heart tightening. Leaning closer, he began to whisper.\n\n\"Ethan… \", a melancholy followed his voice, \"I know a person that experienced a great tragedy, when I see one….\"\n\nThe teacher offered a wide smile, pity evident in his eyes.\n\nUpon hearing those words, Ethan slowly raised his eyes.\n\n\"During the three months you disappeared, I was told you ran away\", the teacher clapped his hands, slowly shaking it.\n\n\"And when you came back you were… a hollow… I want to know what happened\"\n\nEthan took a deep, heavy breath.\n\nAs the air left his body, he wore a faint smile, his gaze fixed on the ground.\n\n\"… I'm sorry… I can't tell you\"\n\n\"I see… it's okay…\"\n\nHe straightened his back and locked eyes with Ethan, his gaze unwavering.\n\n\"You know, I have a friend, well-used to have one. He always said that… human life is basically this. You get born, all kinds of stuff happen... and you die…\"\n\n\"…\", those words caught Ethan off guard. His eyes flinched.\n\n\"He always told me that. So, when he died, I was laughing while crying at his grave Hahahah\", he scratched the back of  his head, awkwardly laughing,  \"Can you imagine?\"\n\n\"…\", Ethan remained silent.\n\n\"But the point is Ethan… the meaning of those words. Is that life is a complicated, chaotic, and messed up affair. None of us leave it unscathed. So... I hope you make the most of your life. Enjoy your gifts. Life is short. And before you know it you'll be dead\"\n\nEthan's eyes abruptly widened, and he locked his gaze onto his teacher, whose eyes mirrored a profound melancholy.\n\n\"… I see… \"\n\n\"Alright, sorry if that's the best I can give you. Hahahahah!\"\n\nHe lightly smiled. Feeling the earnest intent behind his teacher's words, Ethan bowed in front of him.\n\n\"… I will remember, Mr. Travis\"\n\n\"Thank you\"\n\n\n◇ ◇ ◇ ◇ ◇\n\n\nEthan stood in front of the school's gate. \n\nThe final day, and hundreds of students clamored here and there. Many sounds of tears, cries, and joy filled the air.  There's a reason why the last year of junior high ends earlier compared to other years. \n\nIt was a time, dedicated to those that wish to enter Guardian Academies.\n\n\"Ahh! Let's meet again!\" \n\n\"I'll never forget you!\" \n\n\"Let's hang out one last time!\" \n\n\"Alright class, let's go karaoke!\" \n\nSome classes with tight groups went out, others merely scattered. With empty and unfocused eyes, Ethan witnessed the end of his junior highschool. \n\nHe looked at the strangely angled ring in his right hand.\n\n'... No cries, no laughter, no nothing. An utterly anti-climactic end to what could have been'\n\nFor a fleeting moment, the illusion of three kids laughing and jumping as the school year concluded flashed through his mind. But such thoughts quickly vanished... for all that's left is ash.\n\nSuddenly, he heard loud laughter. A group of fellow graduates passed him by.\n\n\"So boss, where are you enrolling?\"\n\n\"UHA\"\n\n\"Ha! I knew it! You're gonna enter there with flying scores!\"\n\n\"It's boss Kevin, he'll be fine!\"\n\nOne of them was a boy with blonde hair and blue eyes. Their eyes briefly met, and a look of disdain emanated from the blonde boy's gaze. Ethan closed his eyes, letting the memory wash over him.\n\nHe turned around and began walking into the city sidewalk. Towards the distant sky, where giant quiet birds flew into the wind.\n\n'_Enrolling into UHA huh…_', Ethan opened his bag and took an obsidian key. An item with queer designs, strange jagged spiraling patterns, and three terrible teeth.\n\n\"… The answer to my questions, huh… \"\n\nA bus passed him by, blocking the sound of the city's noise.\n\n\n◇ ◇ ◇ ◇ ◇\n\n\nEthan made his way home, the sun's orange hue casting a warm glow over the central plaza. He took in the bright billboards adorned with flashing advertisements, the bustling crowds of people, and the hum of electric cars traversing the intersection. On the sidewalk, he noticed floating drones projecting holograms.\n\n*\"Rhea's Drink! Nothing like the love of mother nature!\"*\n\n*\"Axis Armory! A protected body is a protected future!\"*\n\nAlthough the drones were playing pre-recorded human voice, Ethan felt like plugging his ears. The people, the workers, the passing begging children, it was a bustling city, the same as he remembered when he was a child.\n\nAs he walked, he began browsing his phone.\n\n\"Japan just experienced a terrorist bombing. The authorities are still investigating it. The rise in recent terrorism within Japan is said to be linked to a powerful villain group\" \n\n'_… what a bunch of lunatics…_', he squinted his eyes. \n\nSuddenly, the loud noise of voices disrupted him.\n\n\"Stop illegal Immigrants!\"\n\n\"They are bringing their problems to Arlika!\"\n\n\"Return those Desterians to their country!\"\n\n\"The statistics are not lying! Despite making up 11% of the population, Desterians commit 42% of the crimes!\"\n\nA mob of protesters drew Ethan's gaze. In the heart of the central Plaza, hundreds of people were demonstrating outside the Justice Hall, with cameras, placards, and speakers scattered throughout.\n\nAs Ethan saw it, he hastened his steps, quickly vanishing into the crowds.\n\nEventually, he left the busy city center and into the suburban district. Ethan switched to another news, and saw a rather interesting one. \n\n\"The UHD now announces that there are disturbances within the Dimensional Shield. A large scale monster invasion may occur within Southern Asian countries in the coming years\" \n\n'_… United Humanity's Defense against Otherworldly Beings, or UHD_'. \n\nHe couldn't resist gazing up at the sky, where a faint, lattice-like hexagonal grid stretched across everything.\n\n\"… That's right. There were a lot of countries in the past. And seven or so continents… but gods and monsters invaded the world, reducing it all to ashes\"\n\nEthan continued onward, lost in his thoughts, crossing a bridge that spanned the city's river. A few individuals passed by sporadically, but an overall tranquility hung in the air.\n\n'_… And now… we achieved peace to some degree. But for how long can we maintain it?_', he breathed out. For everything he's been hearing from the news lately were nothing but increasing instability and chaos. \n\n'_… Who knows. If only the Elucid King did not disappear sixty years ago…_' \n\nEthan sighed as he strolled through the bridge.\n\nSuddenly, an explosion rocked the air. Ethan swiftly turned west.\n\nAn enormous wave higher than houses surged through the river, causing nearby civilians to flee.\n\n'_… How in the world?_', Ethan frowned. He sprinted to the north. But as he ran, he suddenly saw a little boy playing on the river. The kid didn't look older than 8 or 9 and was wearing a fancy clothe.\n\nNobody noticed the kid, or more accurately, none of them had the time. The flood was approaching and with it, a force that could end lives.\n\nPeople hurried past him, occasionally bumping into his shoulder. Ethan raised his arm towards the boy, but he halted himself.\n\n'_… No, I shouldn't_', Gnashing his teeth. Ethan steeled his eyes.\n\nAs the flood buried the houses, Ethan jumped off. In his right hand, he created a hook with a rope. He threw it back, successfully attaching to the bridge. As Ethan descended, he rapidly lengthened the rope falling right before the brown-haired little boy.\n\n\"… Grab on me!\", without waiting for a reply, Ethan hugged the boy. But the flood already caught up. Ethan held his breath, and turned around, blocking the flood's force as it devoured them. \n\n'_… Ahhh… dammit!_', He bit his lips, enduring the pressure. The little boy tightened his grasp, he saw the fear within his eyes. And those eyes of fear suddenly evoked a flash of memories within Ethan's mind.\n\nA rock suddenly hit his hands, causing him to let go of the rope. The rapid flood pushed him off. As they floated to the surface of the water, Ethan grasped a breath of air. \n\nHe could see the river shoreline swiftly pass through them.\n\n\"B-Big bro!\", the boy looked in his direction. And Ethan noticed a track of blood from his forehead. But he didn't react. His shoes began disintegrating. \n\n'_… then Nitroglycerin…_'\n\n\"… Boy, don't let go!\", Ethan shouted.\n\n\"Yes!\"\n\nEthan removed his hands from the boy, who deeply clutched to him.\n\n'_… Go!…_'\n\nWith his hands  downward, a rapid explosion sent them sideways to the air, drawing the attention of onlookers. As Ethan  descended, he conjured a chemical ball which instantly expanded cushioning their landing.\n\n\"… Guh!\"\n\nEthan swiftly held the boy, crafting a rope and hook with his right hand. A small explosion propelled the hook to a nearby balcony, and a liquid on the rope triggered a rapid chemical reaction, shrinking it and swiftly pulling them.\n\nThe two safely landed on the balcony.\n\n\n\"… Hah… Ha…\" He wiped sweat from his forehead.\n\nEthan gazed below as the flood subsided.\n\nDespite rescuing the boy, a tightness gripped his chest. His mouth folded upward as he watched many people swept away by the flood.\n\n\"Big bro, that was awesome!\", the little boy's blue eyes gleamed.\n\nHe observed the boy's expensive attire: a stylish dark-blue vest, a blue bow-tie, and black shorts.\n\n'_… Designer's brand. His parents must be loaded._'\n\n\"… Where are your parents kid. Why are you alone?\"\n\n\"Ah, that…\", the little boy's eyes turned left and right, awkwardly smiling.\n\n'_… I see. This guy ran away…_', \n\n\"… Let's go find your parents.\"\n\n\"B-But, mommy will scold me!\"\n\n\"… Sigh…\", Ethan bitterly smiled.\n\n\"… Don't worry. Big bro is here\"\n\n\"Oh! Okay then!\"\n\n\"… Do you have any phone, any holo?\"\n\n\"Hmm? Nope!\"\n\nAfter a five-minute wait, the tide subsided. The police and supes  arrived. Ethan deeply sighed.\n\nSuddenly, an explosion and smoke emanated from the north, where his home was located.\n\n'_… Well… that can't be good._'\n\nCarrying the child on his back and securing him with a rope, Ethan scaled down the balcony. Chaos reigned on the ground as Ethan heard the tears and shrieks of pain, causing him to clench his eyebrows. \n\nHe placed the boy in the ground and held his hand. They began walking to the bridge where the police was located.\n\n\"… Kid, what's does your mother look like?\"\n\n\"I'm not Kid!\", the boy grumbled, \"I'm Kiryue!\"\n\n\"… Ah, okay\", Ethan lightly smiled. After the boy described his mother, he asked the police for assistance. And from the crowd in front of the bridge, Ethan heard a shout.\n\nThe little boy dashed towards a woman. Ethan observed from a distance, confirming the boy's rich background.\n\nThe woman, with brown silky hair, wore an exquisite and expensive dark-red dress.\n\n'_… When rich folks enter grateful mode they can get really annoying… and suspicious…_', Ethan shook his head and headed for the bridge. Finding it blocked by the police, he swiftly disappeared into the crowd in search of an alternate route.\n\n\n◇ ◇ ◇ ◇ ◇\n\n\nEthan jumped over a wall and safely landed on a pile of trash, located in a hidden alley.\n\n'_… The smoke came from north-east, so if I go north-west, I should arrive home safely._'\n\nEthan left and stepped onto the road.\n\nAs the wind caressed his skin, his hairs suddenly stood on end. Ethan felt the dripping sweat behind his back. Rapidly he turned around, and his heart began beating faster. The typical bustling street now lay deserted, with an eerie violet hue shrouding the sky and buildings. \n\nAn ominous silence rung within his ears.\n\n'... Something is wrong', Ethan, pulled a silenced pistol from his bag, taking cover behind a tree.\n\nThen it happened. An enormous explosion on the road ahead. Smoke and debris flew into the air. Emerging from the haze at the T-intersection was a bulky man in dark armor with menacing, wide, shadowy wings.\n\nEthan recognized him.\n\n'_… It's the same bastard from morning. Though he looked beefy now, he's definitely the same guy._' \n\nThe smoke cleared, revealing a blue armored man standing, holding his red cape in front.\n\nGlaring fiercely, Dark wing struggled to stand.\n\nEthan's keen eyes detected movement beneath the cape. Squinting, he noticed trembling boy in a nearby school's black uniform.\n\n\"You okay kid?\", The blue-armored man spoke softly. The scrawny, curly-haired child, now seeing his idol up close, beamed with a bright smile.\n\n\"Yes, Union Prime! I'm okay!\" \n\nUnion Prime, a dark haired and handsome man. \n\n\"Don't worry, we'll get out of this mess\" \n\n\"Yes!\" \n\nSuddenly, a seductive, high-pitched female voice suddenly interjected, \"Hoh… I did not expect THE Union Prime to show up in this location of all places.\"\n\nUnion Prime frowned and turned to find a woman in a bewitching violet dress. A small upper jacket concealed her arms and upper chest, while the dress beneath revealed her midriff from her breasts to her belly. Her pinkish-violet hair cascaded with delicate bangs while wearing a skirt made up of nine flowing strips around her waist.\n\n\"Navella…\", Union Prime grimly spoke. \n\n'_… wait… Navella?… Navella as in, the Cursed Dimension Princess?_', Ethan's jaw dropped. \n\n'_… Isn't she a high ranking executive in a world renowned terrorist organization?! A Ranker and a Nation level threat?_' \n\nEthan watched, feeling a cold sweat, concealed under the tree, trying to remain silent. Amid the simultaneous events, one thing stood out.\n\nHis life was in peril.\n\n'_… Holy shit, I hit the fucking Deus Ex Devilus! Goddammit!_' \n\nEthan swiftly created and equipped a gas mask. He then created two filter canisters and attached them. Behind the tree, he discarded his uniform into his bag and replaced it with fire-resistant dark nylon pants and a hooded jacket.\n\nAmid these preparations, explosions reverberated from up ahead.\n\nUnion Prime deftly countered Dark wing, causing him to stumble and collide with a column. Union Prime then shielded himself from a barrage of reddish-violet energy blasts unleashed by Navella.\n\nEthan pressed on, crafting a white hair spray to change his hair color. He remembered his eyes, so he donned a pair of black contact lenses before putting on the mask.\n\n'_... I cannot be identified here_'\n\nEthan grit his teeth. He created a fire grenade inside his bag, with the string trigger poking out. \n\n'_… In case I got caught, I must at least destroy any evidence towards my identity._' \n\n\"Oh my, did you miss me, Darling? To be honest, I did miss... your weapon\", that Navella woman brightly smiled while seductively licking her lips. \n\n'_… What?_', Ethan tilted his head. \n\n\"That was a mistake, you wretch! I cannot believe I trusted you!\", Union Prime glared with a flushed face.\n\n\"Hahahah! You should be grateful to me! If it weren't for me, you would've stayed a deadbeat you wimp!\" \n\n'_… what? What? What?_', the scrawny kid ahead opened his eyes widely. \n\n'_… the fuck?_', Ethan dropped his jaw. \n\nUnion Prime, though briefly flustered, remained unfazed. He fixed a stern gaze on his two enemies. As Navella kept him occupied, the Dark Wing pulled a device from his pocket and activated it.\n\n'_I can't move carelessly…_', Union Prime quietly thought, '_… With this kid at my back, a wrong move and they'll aim for him. That dark haired man has been eyeing him for a while_.' \n\n\"And so, if you want to sleep with me, you can just call me, Darli-\" \n\n\"Enough! I know you're just buying time\" \n\nUnion Prime's eyes emitted a brilliant blue light.\n\n\"Oh, that's… scary…\", Navella took a step back. \n\n\"Return the box you stole\", Union Prime took a step, causing the road to break. \n\n\"I'm afraid not\", Dark Wing unleashed a laser sword in his right arm while Navella started forming circles with mystic formations around her. \n\nAnticipating an imminent battle, Ethan gripped his silenced pistol with both hands, silently monitoring the unfolding scenario, hardly daring to breathe.\n\n'_… Please don't notice me. Please don't notice me. Please don't notice me. Please don't notice me. Please don't notice me. Please don't notice me. Please don't notice me. Please don't notice me._' \n\n\"… So be it\", Union Prime heavily uttered. \n\nBut as he leaned forth, his balance was broken by a sudden violet flash. Smoke filled the air, and a roaring followed.\nUnion Prime stood steadily in front of the boy.\n\nThe scrawny boy, observing the scene, bit his lip and clutched his heart in anxiety.\n\n'_I'm useless. If it weren't for me, Union Prime could have captured them. I'm so useless!_' \n\n\nAs the smoke cleared, a colossal monster emerged. It possessed six human-like legs, four robust, beastly arms, and a hairy body with a gaping maw at its center.\n\n\"Grr!\", Union Prime grumbled as the beast intently aimed for the boy. He raised his arms, blocking its attacks. \n\nThe two enemies left, but Union Prime dismissed the thought as he had a boy to save. \n\nBut while that was happening. \n\nEthan's eyes was wide opened. \n\nAt that moment when the smoke and light erupted, someone suddenly materialized beside him. As he turned his gaze to the left, their eyes met – it was Navella, her eyes wide in surprise.\n\nAnd then… there was fury in her eyes upon seeing him. \n\nNavella's eyes gleamed briefly before she, along with Dark wing, vanished into a ripple in space. The violet world's hue dissipated, leading Ethan to believe he had returned.\n\nEthan then looked ahead. The monster unleashed a ferocious barrage of attacks, which Union Prime blocked effortlessly. Ethan took a deep breath, calming himself after the shock.\n\nSuddenly, a tremendous explosion resonated, causing the monster to collapse with a massive hole in its body. Startled by the noise, residents from the surrounding houses and apartments emerged or peered out from their windows.\n\nEthan swiftly concealed his gun in his bag, reacting to the commotion.\n\n'_… This is not a registered firearm after all…_' \n\nHe got to his feet and swiftly fled the scene.\n\nAlthough he had an exciting story to tell, Ethan will keep it a secret. He knew well what these dangerous people are capable of. \n\nAnd he was not having it. \n\n\n◇ ◇ ◇ ◇ ◇\n\nThe monster's organs fell from the sky, bloodying everything in its wake. \n\n\"Hah, now that that's over…\", Union Prime turned around and smiled at the kid. \n\n\"You okay, boy?\" \n\n\"Y-Yes Union Prime!\", The boy beamed with delight but soon his expression soured into sadness.\n\nThe boy then bowed, \"I'm so sorry!\" \n\n\"Hmm?\", Union Prime awkwardly smiled.\n \n\"If it weren't for me. You wouldn't need to hold back! If only… If only a powerless like me didn't rush towards that kid, and tried saving him… then, then-\" \n\nA crowd gathered as they saw Union Prime, causing a commotion. Seeing this, Union Prime swiftly carried the boy and flew away.\n\n\"Eh?\", the boy didn't have time to react.\n\nAs they soared through the sky, Union Prime maintained a slow, low-altitude flight. After a minute, they landed safely on a skyscraper's flat rooftop.\n\n\"Eh? Um? Why are we here sir?\", with creased eyebrows, the scrawny kid stared at him. Standing in front of him, Union Prime smiled.\n\n\"Because we couldn't talk properly if we're down there\" \n\n\"Oh, ah, I see…\", the kid shyly rubbed his hair. \n\n\"Tell me, why did you save that kid before? I mean, we met before already\", Union Prime sighed. \n\n\"You don't have any superpower, you will only endanger yourself\" \n\n\"T-That… That's because I….\", the scrawny kid bit his lips. \n\nHe paused. He opened his mouth, and then he closed them.\n\nFinding his resolve, he stared straight forward towards Union Prime with widened eyes. \n\nDespite his shaking body, he spoke it. \n\n\"M-My body just moved on its own. B-Because I thought… that kid needed help. A-And there was no one around. I just thought that… that was the right thing to do!\" \n\nUnion Prime's eyes widened in disbelief. He could not believe there was actually a kid this stupid out there who would sacrifice his self for such a reason. \n\n'_No_', Union Prime shook his head, '_… I was also exactly like this stupid kid. It was this exact reason that my master chose me._' \n\n\"Hey kid… no… Akiyoshi…\" \n\n\"Huh?\", Aki stared straight into Union Prime's eyes. \n\n\"You said you wanted to be a Hero, right?\" \n\n\"Y-Yes!\" \n\nAnd with great kindness, he spoke the following words. \n\n\"You can become a Hero\" \n\n\n◇ ◇ ◇ ◇ ◇\n\n\nRunning through the shadows of the alley ways, Ethan grit his teeth. Ten minutes passed, and he managed flee a hundred meters away. \n\n'_… She saw me. Navella fucking saw me! Dammit!_', He fully understood the situation. \n\n'_… She was angry. She suddenly became angry when she saw me! Why was she angry? Why would you get pissed that some external nobody observer saw your secret battle in a secret space against Union Prime?_' \n\nGritting his teeth with a deepening frown, Ethan continued his frantic run, growing increasingly suspicious. Then, suddenly, he came to an abrupt halt.\n\n\"… Wait, maybe…\" \n\n'_… I should've run to Union Prime?_' \n\nJust a few more steps, and Ethan would reach a bustling market district, an alley opening up before him.\n\nBut as if the world stood frozen, a shadow cast itself upon Ethan, revealing a dark winged man.\n\n'_… I'm dead…_' \n\nEthan immediately raised his arms.\n\n\"… P-P-Please don't kill me! I'm just a random bystander!\" \n\n\"Hoo\", it was a deep and menacing voice. \n\n\"Even if you were an innocent bystander, I still can't let you live…\" \n\n\"… I-I-It was an accident! I'm just an innocent kid!\" \n\nHe advanced, his right hand transforming into black claws, dark eyes locked onto Ethan with murderous intent.\n\nEthan stepped back, clenched his teeth, and retrieved his silencer from his bag. \n\n\"Die!\", shouted Dark wing. He charged to attack Ethan, who narrowly dodged and fired. Most shots missed, but a few grazed the man's armor.\n\n'_… Tsk… Bullet resistant armor…_'\n\nThe enemy's wing swung dangerously close to Ethan, but he skillfully bent backward to evade. Seizing the opportunity, the man then aimed a slashing strike at Ethan's neck. In response, Ethan pointed his left palm forward. He created a compound, bursting a smoky explosion to Dark wing's face which propelled him away.\n\n\"Gah!\" Dark Wing staggered back, coughing, then swiftly flapped his wings to disperse the smoke.\n\nAnd then. Dark Wing's sight started to stagger. The world began rolling in a hazy delusional feat.\n\n\"What did you do to me?\", Dark wing shouted, but Ethan had vanished. Feeling a murderous intent behind him, he swiftly turned and found Ethan's palm and feet pinned to the alley wall, his right hand holding a silenced pistol. Three bullets were fired, and Dark Wing's tail blocked each with explosions, creating a smoky chaos.\n\nDark wing held his breath. He took a step back, but found both his feet restricted by a sudden sticky paste.\n\n'_What?_', Confusion clouded his thoughts. When he attempted to move, he found the world had slowed down. Every action felt sluggish but sporadic.\n\n'_What is… happening_', he felt a gun pointed at the back of his head.\n\nAs the world around him begun to stumble into a myriad colors of non-euclidean madness, he had an epiphany. A sudden clarity, but all too short, only enough for him to understand what had happened.\n\n'_Ahh…_.'\n\nBlood splattered through the air. A single, silent flick was heard, followed by the Dark wing's fall. But it didn't end there.\n\nEthan unleashed more bullets at his skull, each shot dyeing the ground a blooded art.\n\nHe repeatedly pulled the trigger, scattering the dark wing's brain matter. It didn't end there; he then poured a silvery liquid compound directly into the bullet-riddled remains his enemy's brain.\n\nEthan breathed in and out. Sweat filled his forehead. His hands and orange-red eyes trembling. There was now nothing but silence and the humble buzzing of the city. Memories flashed through his mind, almost making his stomach acid rise.\n\nBut as the memories flooded, Ethan began calming down.\n\nAnd he simply left… without making so much as a sound. Leaving behind the corpse of his enemy.\n\n\n◇ ◇ ◇ ◇ ◇\n\n\nThe sun sets, dyeing the sky with its peaceful shade of red\n\nA young man breathed roughly, seating on the ground, panting underneath the darkness of a bridge. \n\nEthan reached for the river stream. He removed the last bits of white color from his hair. \n\nWithin this secluded forest area, Ethan discarded his dark jacket and pants, bundled on the rocky ground before donning his uniform again.\n\nHe swallowed, before closing his eyes. Light reflected upon his face, as the fire from his palm burned the clothes. His body shivered, and his breathing grew faster and faster as he watched the fire flicker. He clutched his heart, a dreadful fear invoked upon his mind.\n\nHe lightly opened his eyes. But a single glance at the roaring flame caused a sudden rush of memories.\n\nThe bleakness loomed into the sky. Blazing flames devoured everything. As the smoke rises, so did the screams, the trembles, the horrors, and the madness of everyone fleeing from a monster.\n\nA young boy weakly pushed a cart filled with five people and a girl. Strapped on his back was a blonde haired boy. Dried tears colored his face. His eyes were wide opened, painted upon it was despair.\n\nFor every time he pushed the weak, wooden cart, it would creak, almost stopping, almost not budging. But he pushed, pushed and pushed, for he didn't know what to do, or what to think, or what to feel.\n\nEverything was too quick for his mind to understand. As the trees and buildings crumbled besides him, as the people ran and squashed by the falling debris from the fire and smoke, the young boy… stared ahead, in horror.\n\n\"… I will save you guys… I will save you… I promise it…\"\n\nStumbling, the cart hit a rock, spilling its passengers. Desperate, the boy crawled to their aid. A burning house's timber creaked and fell, trapping them. He weakly pushed the timber away, pushing with all of his strength. Despite carrying another person, the boy merely echoed a silent shriek. The timber fell off, he looked at those it trapped, and his eyes squinted in horror.\n\nBecause those five people… had gaping holes in their chests.\n\n\"… Big sis, Gain, Jex, Master, old man Kendrick, d-don't worry…\", the young boy smiled, and he desperately pushed every person back to the cart, even the unconscious girl.\n\n\"… E-Everything will be okay… E-Ehan will s-save you all… I w-will… save all-all of you… I will… I will…\"\n\nThe Night blazed on. Burning all hope down to ashes. \n\nAnd on that day… Ethan Morales died.\n\nHe opened his eyes once more. The clothes he used for disguise were no more than a pile of charred dust. Ethan swept it away with water.\n\nAnd from the depth of his mind, the words of his mentor appeared\n\n\"_Remember Ethan, a Hero is not born from happiness… but from the burning desire to do what Ought to be done…_\"\n\nHe was silent, and then he lightly smiled. A sardonic smile, followed by a cynical chuckle. Then he froze. His face became empty. Dullness filled his eyes. \n\n\"… I am sorry master… I can never be a hero anymore… \"\n\nEthan sighed. He created a long, dark brown wig, which covered his head and face. He began walking away from the under bridge.\n\n'_… This time, I did better. I made smart choices. I didn't fail_.' \n\nHe gnashed his teeth. He sported a melancholic gaze. And he clutched his heart. \n\nAs the vision of his recent murder flashed through his mind, his heart started beating faster and faster. A few moments later, Ethan exhaled. His heart calmed down.\n\nHe looked into the distance, towards the setting sun.\n\nIt was the same time back then, the same scenery. Flashes passed through his mind as he remembered a painful memory, of three kids playing heroes, of one kid having to choose between his two friends…\n\nAnd of his very own impotence and failure.\n\n'_… I must never fail again_.' \n\nEthan started walking home.\n\n'_… I must become stronger… so that one day… _', and his face twisted into an ugly and furious sight, with a deep frown and a maddeningly arched mouth.\n\n'_… I will be able to butcher that thing._'\n\n\n◇ ◇ ◇ ◇ ◇\n\n\nEthan entered their home apartment. He already threw away the wig. \n\n\"… Mom, I'm home\" \n\n\"Ah, Welcome back!\" \n\nHis mother greeted him. Seating by the sofa and watching television. She had dark hair like him, tied in a low side ponytail. Her eyes were bright-red and her skin was silky white. She wore a humble green housedress, appearing beautiful and youthful despite being in her 30s.\n\nAt the medium-sized apartment, the Morales family lived here for the past few years. \n\n\"… Mom, when is dad coming back home?\", Ethan asked, seating before the front door, removing his shoes. \n\n\"Ah, your dad said he'll be back this Saturday. He said he found a good contract, and he'll be able to buy us a house once it's done\", Mother Morales kindly smiled.\n\n\"… Ah, Dad sure is hardworking\"\n\nAfter removing his shoe, Ethan stood up.  He was lost in thoughts. The battle of Union Prime, the two dangerous enemies, as well as his murder of one of them. It continuously played through his mind. \n\n'_… I did my best to conceal my identity… but in the off-chance they learned of it…_', Ethan frowned. \n\nEthan opened his eyes widely. His mouth shivered, but he closed it. He stared at his mom's eyes with seriousness, and he spoke his mind. \n\n\"… I'm applying to UHA\" \n\n\"No.\", his mother frowned, deeply rejected him.\n\n\"Look at the world Ethan!\", Mother Morales pointed at the television. A school was under attack by villains, with heroes coming to the scene. \n\n\"Being a Superhero means risking your life every, single, day, Ethan! Do you have any idea how much I worry just letting you go to school?\", she glared at him with sharp eyes.\n\n\"… Tsk\", Ethan frowned in annoyance.\n\n\"… And you want me to give up my dream for your own selfish reasons?\", Ethan howled. \n\n\"Yes! I'm selfish, I know it!\", his mother stood up, \"It was my fault Ethan! I shouldn't have shown you that video years ago! I shouldn't have told you all of those stories! I-If that was the case you wouldn't have developed your power to such an extent!\", Mother Morales slowly became emotional. Her face begun to flush with a shade of red.\n\n\"… Dammit Mother! You've always been like this! Why are you telling me this now?! Wasn't it you who encouraged me to improve MY USELESS power!\" \n\n\"I didn't mean it Ethan!\", his mother shouted. \n\nEthan stood in silence. From a corner, he could see his young eight-year-old little brother across the room, peeking at them from the door. \n\n\"I was just… a confused, 21-year-old young mother who knew nothing, trying her best to save her son. So I said what I had to say! I, I, do you have any idea, how many friends I had who lost their children because they all wanted to become heroes?!\", his mother started to cry. Tears ran down her face. \n\nAnd Ethan became silent. Biting his lips, he stared at the floor.\n\n\"Do you have any idea, how much blood, sweat, and tears I went through to raise you and Isaac! We moved houses after houses, trying to rise from our poor, meager life! We barely had food, much less dinner, we only had salt and rice! We had to avoid loan sharks, cartels, criminals from the ghetto! Moving from our home country Desteria to here in Arlika took everything we had, Ethan!\", slowly, his mother calmed down. \n\nAnd slowly, she went forward. Her mouth arched upward.\n\n\"Me and your Dad… did everything we could, to protect you both and give you a better life…\" \n\n\"… \" \n\n\"And now, you're telling me you will jump straight into the fray, into the world that we tried our best to stay away from? Ethan! I already almost had a heart attack over that accident a year ago! I can't, I can't handle this! Do you have any idea, how much my heart broke when I learned that you, Kevin, and Vanessa were doing Vigilante work? And you almost died! All of you almost DIED Ethan! Do you understand! DO YOU UNDERSTAND?! I don't want you to become like her!\" \n\n\"…\", Ethan gnashed his teeth. \n\n\"Your power… your ability to create anything you wish… I've seen what countries did to very exceptional supes Ethan. They turned them into nothing but tools…\" \n\nShe raised her hands, gently holding his face. Ethan saw her tears flowing.\n\n\"I don't want you to end up like them. A mere shadow of whom you used to be. I just want you to grow up into a nice, healthy man, with a good profession in society. You can still be heroic in other ways. But not like this Ethan… please… Not like this\" \n\nEthan's eyes became teary red. He remembered what happened earlier. Had he made the wrong move, had he been slightly slower, he could have died.\n\nMaybe by now, his mother would have been crying already… \n\nHe tightly clenched his fist.\n\nHe didn't know what to say."}}}, "tags": "", "parent": "tboah-chapters"}