{"areas": {"full": {"profile": {"Title": "Leticia Lewinne", "Image": {"Original Art": "assets/images/e-class/leticia/leticia-original-art.png"}, "Content": {"Desc": {"Full Name": "Leticia Evangeline Brown", "Alias": ["The Champion of Chaos", "Missing Champion", "The Most Dangerous Member of E-Class", "Destroyer"]}, "Biography": {"Race": "Human", "Birthday": "29 August", "Age": "15", "Gender": "Female", "Height": "167 cm", "Weight": "51 kg", "Hair Color": "Golden Blonde", "Skin Color": "Light", "Blood Type": "O"}, "Power": {"Rank": "1st Awakener", "Active": ["Disrupt"]}, "Status": {"Status": ["Alive"], "Birthplace": "Unknown", "Family": [null]}}}, "tabs": {"Overview": "> I am Leticia Evangeline Brown. I was born in the 17th June of the Year 2016. I am the Champion of Chaos and I was there when the Reckoning began. I battled alongside other Champions to stop the invasion of the Abyss. I fought against the Elucid King and I was sent lost through time as a result of our battle. I am of the Old World - Leticia Lewinne, revealing the truth to E-Class\n\nLeticia Lewinne is one of the main characters of [[tboah]], a member of [[e-class]] and the missing Champion of Chaos.\n\nDue to the fragility of her young mind, that being a 10 years old girl, she was unable to control her power and killed 10 Million people on earth and wiped out an entire city. As a result, the ElucidKing personally stepped up and subjugated her. But as a result of the conflicting nature of their powers, she was sent to the future.\n\nCurrently, she’s the adoptive daughter of a rich oil baron.\n\n[[toc]]\n\n# Appearance\nLeticia is a beautiful girl sporting a golden blonde hair, as a result of her British lineage. She possess a pair of Amethyst eyes, a mutation caused by her powers of chaos.\n\nShe often wears a purple choker over her neck. But this is not for aesthetic purposes only as it is a limiter preventing her from unleashing the full potential of her powers. She often wears revealing and short length clothes as a way of rebelling against her overprotective adoptive father.\n\n# Personality\nLeticia has a very snarky and proudful personality, often unwilling to do what others want purely out of vanity. She often plays with her phone and refuses to talk to others. Leticia can also get quite talkative in things she has an opinion on. \n\nDespite her proud nature, Leticia is a very kind girl who often feels a great sense of guilt whenever she accidentally harms others before her. However, she takes no such reaction against those she recognize as deserving of suffering.\n\n# Motivation\nLeticia wants to go back through time to save her parents whom she accidentally killed after her awakening into a Champion of Chaos. She also wants to go to ancient archives and find the evidence of her parent's existence and to finally remember their name.\n\n# History\nLeticia was born from two loving parents. She remembered how her Father scrapes by for whatever money he can get and the many days where they barely had anything to eat. Eventually, her father's business bloomed and they finally were able to live a decent life. She still clearly remembers when they had their first bountiful meal in a fancy restaurant and how her father and mother cried.\n\nBut all of this changed when Leticia awakened as the Champion of Chaos, accidentally killing her parents.\n\nEver since then, the 10 years old Leticia became depressed and suicidal. It was until she met [[The White Troupe]], a group of champions led by the ElucidKing at the time. Slowly, she came to bond with them and befriend them.\n\nFor a time, she worked with [[The White Troupe]] and thus with UHD's Frontier against the invading Abyss. But the machination of her [[Primogenitor]], the God of Chaos would lead to her losing her mind and wiping out an entire city of people, killing 10 Million.\n\nThis in turn forced the ElucidKing to subdue her. But the resulting battle led to her Aspect of Chaos and the ElucidKing's unknown powers to collide, sending her lost through time. Contrary to her belief, the Elucidking did not sent her to the future, it was purely by accidence she returned to earth 200 years later. What truly happened was that she was sent into the limbo between reality and time, literally lost.\n\nWhen Leticia arrived in Saudi, she became a beggar. Afraid and confused, she didn't know what to do as she woke up in a world completely alien to her. As nobody could understand English, she had nobody to speak with and became lonely.\n\nit was during this time of begging that she met an old man, Rudolfo Lewinne. A rich oil baron with a keen interest in the Old World. He took pity at the young girl and decided to take her in and teach her the New Tongue. He decided to adopt her as his own granddaughter, treating her with much Love and respect.\n\nSeeing that Leticia had a lot of past trauma and realizing that she was the Champion of Chaos, [[rudolfo-lewinne]] decided to have her powers sealed through his connections and have her memories blurred so as not to make her suffer.\n\nLeticia then grew up to be a beautiful and smart girl, with a competent problem solving skills.\n\nWhen Leticia was 15, [[rudolfo-lewinne]] decided to send her to [[UHA]].\n\n# Ability\n- **Champion of Chaos** - As the Champion of Chaos, Leticia is fully capable of wielding supreme magic of the chaos element, capable of casting a variety of spells that can destroy entire cities.\n- **Quasi-Eldric Physiology** - As a champion, Leticia's body is completely different than a normal human as she is capable of withstanding attacks, damages, and any manners of harm in much longer term than any average human can. She also possess a great deal of mana which does not rely on the world to replenish. She also possess a greater form of regenerative ability.\n- **Aspect of Chaos** - Leticia is capable of controlling Chaos itself and creating havoc wherever she wishes.\n- **Teleportation Magic** - Leticia can cast a massive array of teleportation spells.\n\n# Equipment\n- **Divine Chaos Gulgnir** - Leticia's divine artefact. A spear-like artefact with chaos rings around it. Gulgnir can enhance her chaos powers and give her a superior mana regeneration. Gulgnir also has the ability to break holes through space itself.\n\n\n\n\n\n\n\n"}}, "preview": {"profile": {"Title": "Leticia Lewinne", "Image": {"Original Art": "assets/images/e-class/leticia/leticia-original-art.png"}, "Content": {"Desc": {"Full Name": "Leticia C. Lewinne", "Alias": ["Alias"]}, "Biography": {"Race": "Human", "Birthday": "29 August", "Age": "15", "Gender": "Female", "Height": "167 cm", "Weight": "51 kg", "Hair Color": "Golden Blonde", "Skin Color": "Light", "Blood Type": "O"}, "Power": {"Rank": "1st Awakener", "Active": ["Disrupt"]}, "Status": {"Status": ["Alive"], "Birthplace": "Unknown"}}}, "tabs": {"default": "Leticia Lewinne is one of the central characters of [[tboah]] and a member of [[e-class]]. She is a beautiful and classy girl who came from a wealthy family.\n\n[[toc]]\n\n# Appearance\nLeticia is a beautiful girl sporting a golden blonde hair, as a result of her British lineage. She possess a pair of Amethyst eyes/\n\nShe often wears a purple choker over her neck. She often wears revealing and short length clothes as a way of rebelling against her overprotective adoptive father.\n\n# Personality\nLeticia has a very snarky and proudful personality, often unwilling to do what others want purely out of vanity. She often plays with her phone and refuses to talk to others. Leticia can also get quite talkative in things she has an opinion on. \n\nDespite her proud nature, Leticia is a very kind girl who often feels a great sense of guilt whenever she accidentally harms others before her. However, she takes no such reaction against those she recognize as deserving of suffering.\n\n# Ability\n- **Disrupt** - The ability to disrupt any system. Currently, Leticia can't control it and it goes off randomly."}}}, "tags": "", "parent": "tboah-characters"}