{"areas": {"full": {"tabs": {"default": "During a time of great technological advancement of science and magic, the gods used to walk the lands with mortals and beings of myth. For hundreds of thousands of years, there was indefinite peace as [[Mirdum]] is held as one of the most powerful planets in all of [[Abyss]], protecting itself against invasions of Alien species.\n\nBut a time came when the relationships between mortals and gods began to grew sour. Whether it was boredom, or a change in the threads of fate, or something else, the gods began toying with mortals. They breed mortals to deformed entities, experimenting them, treating them like cattle, granting them strange destinies which lead to their demise and destruction of life. It reached to the point where even the goddess of love would create sport on how many could give birth to many different kinds of beings, or the god of war would began many many war, and the god of knowledge would sacrifice so many millions of lives for the sake of finding out what each runes or magic does.\n\nWhen the murder and the killing began consuming life in the billions and the gods began mass producing mortals, it was at this point when the mortals have had enough and began an uprising. The initial start where met with great thunder from the indifferent god of light. \n\n[[Khione]], disgusted by the barbarous acts of her fellow gods, began colluding with mortals to overthrow them. During this time, the Elven kingdom [[Endoral]] was fighting multiple fronts against enemy kingdoms which has completely fallen into the grasps of the evil gods. it's ally nation, the [[Imperium of Man]] sent an army to aid [[Endoral]]. One of the captains of the Imperium was a budding young man named [[Artoria]]. He had witnessed the madness that the gods have spurned and with his mighty glaive, helped win the tides for [[Endoral]].\n\nIt was a battle of Attrition, as [[Khione]] helped evacuate the mortals from nations which hasn't been corrupted. Spaceships from [[Endoral]] and [[Imperium of Man]] evacuated most of their citizens. But Khione couldn't evacuate all of them enough as she had been ambushed by other gods and was vanished to the [[Void]]. \n\nWithout their only patron goddess supporting them, the remaining nations were butchered and destroyed.\n\nHaving lost the army, his high command, and losing all of the men under him, Artoria, despite being a [[Swordmaster]] and a [[Hoonding Warrior]], fell into depression and fell into the crevice of the sewers of the former capital of the Imperium of Man. During this time, Artoria met the [[Blue Beggars]], a group of beggars living in the sewers who practiced Philosophy. Having heard their wisdom and without much to do, he listened to them and became enlightened. \n\nArtoria gathered all of their knowledges, and within the lowest dregs of society, where Artoria learned to gather and scoop feces to make a living, he successfully created [[Soul Cultivation]]. And within ten years, grew as powerful as  a minor god.\n\nWithin fifty years, Artoria was as powerful as the weakest of the Major Gods. And after a hundred years, there was no more god who could stop him.\n\nWhereas [[Ascension]] is an act of rejecting the concept of [[Mortality]] and returning back to the Original State of existence as one part of nature by, understanding and comprehending it's aspect, [[Cultivation]] is the act of embracing [[Mortality]], weaponizing their finite life to overcome the limits of reality, allowing them to create their own nature and rejecting Nature itself.\n\nArtoria then began teaching other mortals like him, creating an army of Cultivators who were as powerful as the Major Gods themselves.\n\nAnd then began the [[Eternal War]]. The battle itself shook space and time as Artoria took his generals and liberated all of Mirdum. He then went on to Personally slaughter most of the Major Gods and refining their existence into cursed legendary artefacts called the [[Eternal Artefacts]].\n\nAfter tens of thousands of years of war, liberating other planets and parts of the Abyss, Artoria succeeded in killing the Dragon God of Time and stealing his aspect of Time and making it his own.\n\nIt is said that the [[Eternal War]] was such a chaotic and destructive event that it led to the corruption of the other half of the [[Dreamriver]], turning it into a viscous hell of insanity and evil, where poor souls which crosses it are corrupted and turned into powerful malignant spirits.\n\nAs Artoria fully became the God of Time and he imposed the [[Sacrilege of Time]] upon all Gods, causing them to be incapable of freely moving through time and becoming bounded to Time itself. The gods will now age as mortals do. After killing more than a million gods and refining them into [[Eternal Artefacts]], he left away, conceiving what lies Beyond the Horizon.\n\nHis whereabouts are unknown but speculations says that he met the God Oversoul, Enderion.\n\n\n\n\n"}}}, "tags": "", "parent": "history"}