{"areas": {"full": {"tabs": {"default": "E-Class is the last class within [[UHA]] and is isolated on top of a mountain.\n\n[[toc]]\n\n# Entry\nTo be legible to enter E-Class, a student must score at minimum of A in their [[Fanaticism]] category score from their Ability Assessment Chart. The [[Fanaticism]] category is evaluated by an [[Elder Spirit]] residing within [[UHA]].\n\n# Location\nThe Class is located on top of a mountain, north-east of the school grounds. From it, everywhere from the City can be seen. Classes of E-Class occurs in a very old school building, possibly dating to before [[The Reckoning]] itself, as some would say.\n\nThe Classroom is quite humble, possessing powerful strength uncanny for its kind that no amount of beating could even scratch its surface. Its surrounding by a dense forest area with a wide track and field on its own right in front.\n\n# History\nWhen the [[ElucidKing]] first founded [[UHA]] Academy, he noticed that it somehow attracts a percentage of the most terrible students from all over the world. These students were complete sociopaths, without any care for safety but only the adherence of their pleasures and desires. The [[ElucidKing]], however, saw the potential within these young students, hence [[E-Class]] was born to isolate them so they will not do harm to the rest of the Student body.\n\nWithin the mountain, the Academy can focus on rehabilitating these students to they can become healthy members of society. While the program succeeded in turning most students into proper, Empathic adults, some were beyond hope and became a menace to the entire world. Although the number were few, it was enough to label E-Class as the \"Breeding Ground of Demon Lords\" to those in the know-how.\n\nFor years to come, the [[ElucidKing]] went on to hide the existence of E-Class, so much that he classified it as a [[Level Zero Holy Ground]], a title that means not even an [[Eldrada]] can enter the sanctuary. Each members of E-Class were secretly given honorary [[Avalon]] citizenship, the Divine City on Earth. This means no international organization can do them any harm, as doing so will invoke Article 3 of the [[Avalon Charter Pact]] which will allow [[Shadow Garden]] to \"Completely Annihilate\" any aggressor entities regardless of affiliation.\n\n# Teachers\nThe current teachers of E-Class are the following\n* [[Agatha]]\n\n# Members\n\n\n[[Ethan Morales]] [[Jay Baker]] [[Romel Campbell]] [[Isko Devera]] [[Reginald Guillory]] [[Klein Huber]] [[Efren Morris]] [[Ranko Castellano]] [[Benjamin Sanchez]] [[Grant Wilson]]\n\n[[Eltia Axolin]] [[Niña Bach]] [[Giselle Iridao]] [[Leticia Lewinne]] [[Yasha Romanova]] [[Maurish Serrano]] [[Mayumi Severino]] [[Amihan Villanueva]]"}}, "preview": {"tabs": {"default": "E-Class is the last class within [[UHA]] and is isolated on top of a mountain.\n\n[[toc]]\n\n# Location\nThe Class is located on top of a mountain, north-east of the school grounds. From it, everywhere from the City can be seen. Classes of E-Class occurs in a very old school building, possibly dating to before [[The Reckoning]] itself, as some would say.\n\nThe Classroom is quite humble, possessing powerful strength uncanny for its kind that no amount of beating could even scratch its surface. Its surrounding by a dense forest area with a wide track and field on its own right in front.\n\n# Teachers\nTo be a teacher in E-Class, a strict process is done which evaluates their past, present, and future. Every teacher assigned to E-Class are very powerful beings, as it is necessary that they can control these students. The current teachers of E-Class are the following.\n* [[Agatha]]\n\n# Members\n[[Ethan Morales]]\n[[Jay Baker]]\n[[Romel Campbell]]\n[[Isko Devera]]\n[[Reginald Guillory]]\n[[Klein Huber]]\n[[Efren Morris]]\n[[Ranko Castellano]]\n[[Benjamin Sanchez]]\n[[Grant Wilson]]\n\n[[Eltia Axolin]]\n[[Niña Bach]]\n[[Giselle Iridao]]\n[[Leticia Lewinne]]\n[[Yasha Romanova]]\n[[Maurish Serrano]]\n[[Mayumi Severino]]\n[[Amihan Villanueva]]"}}}}