{"areas": {"full": {"tabs": {"default": "The White Troupe is a legendary group of Heroes and Champions led by [[Marcus Romulo]] during the [[Reckoning]]. It's members were some of the most powerful beings of their time.\n\n[[toc]]\n\n# Members\n- [[Marcus Romulo]] - The Leader and Founder of the Group.\n- [[Isabelle Ramos]] \n- [[Mia Hasegawa]]\n- [[Catherine Escalona]]\n- [[Satorou Nishimura]]\n- [[Alexander Moore]]\n- [[Calida Realonda]]\n- [[Faustina Sanchez]]\n- [[Darius Smith]]\n- [[Reigen Storm]]\n- [[Sneako]]\n- [[Leticia Lewinne|Eva]]\n\n# History\nDuring a time when UHD sends its Champions in groups of two or three to complete missions for it, there was a moment when multiple groups of heroes accidentally came together to fight against a common enemy, namely, the Leviathan.\n\n[[Marcus Romulo|Marcus]] was with [[Isabelle Ramos|Isabelle]], exploring a dungeon for a material that Marcus needed when they encountered [[Alexander Moore|Alex]], [[Calida Realonda|Calida]], and [[Satorou Nishimura|Satoru]]. As they had crossing interest, they decided to team up. But during this time, Marcus was still known as a regular guy, often not fighting and merely suggesting strategies. When they later found that Marcus creates sound and superior battle strategies, they temporarily held him as leader, allowing them to successfully conquer the dungeon. This was the beginning of the trust between Marcus and the heroes.\n\nAfter many events, the rampant corruption and inefficiency of UHD let to many Champion's disillusionment and strayed off from the organization. In search of leadership and being branded as traitors by UHD, a group of heroes, composed of Satoru, Isabelle, Calida, Reigen, and Darius came before Marcus to formally request him to lead them.\n\nAfter resting for a long time and witnessing the fall of his fellow men, Marcus relented and accepted his role as their Leader and finally revealing the [[White Eyes]].\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n"}}}, "tags": "", "parent": "tie"}