{"areas": {"full": {"tabs": {"default": "**Author**: Faolagan Slanei\n**Category**: Myths and Religion\n**Archived by**: Bardin the Handsome\n**Librarian Comment**: Another copy from the celtic larper. And by the Divines, those damn barbarians! I found it in a cave, drenched in water. There were molds in it. As a Keeper of books, I simply could not let such treasure rot. May Aeolius lay his wrath upon these degenerates.\n\n**Book Content**:\n\nThe Celts, unlike the other pantheons which worships 12 gods, we worship 14 of them.\n\nMy analysis have concluded that we have a representation for the 12 Gods that other pantheons have, except we have 2 other god which is unique to our culture.\n\nBut this, I cannot be truly certain.\n\nThe Ferret, is an interesting god to speak about.\n\nIt is worshiped predominantly by our people bordering Aulmeria and many other scattered tribes throughout Heilgrim. Because its sphere of influence is reason, I initially thought it must be another representation of the Owl, but i was wrong. Every tribe of Celt I asked were adamant that the Ferret is a separate being to the Owl. Then, is it the representation of the Dove? For the Dove has also been worshiped by those seeking wisdom. But it isn't it either!\n\nThen I thought it must have been the Representation of Fygnell! There's no way I could be wrong! But its not that either! The stories of the Ferret is quite vague, but one rang prominent.\n\n> \"And the Ferret crossed the continent, and with their song of slyness, tricked the gods in handing over the divine fruit, fooled the sea serpents to handing over the harp, and convinced the titans to peacefully rest\"\n\nI do not know what to make of this. It became apparent that everyone keeps worshiping the Ferret because they were used to it, and the knowledge for why has long been forgotten.\n\nThrough my research, even delving deep into forbidden Dwener dungeons, those god forsaken places, I found a clue as to what the Ferret is!\n\nI found a journal, dating back to before the First Era even began! Legends has it that Anessa the Saint made a pact with the Divines. As a result, we gained permanent protection from the Oldrim gods.\n\nThis legend was mention in that journal, confirming its validity. What's interesting, however, was that the journal mentioned a man whom the author of the journal, who ever they are, described as the **Ferrod**. Through my careful translation, I have uncovered the meaning of this word...\n\n\"Bloom Jelly Addict\"\n\nWhat? I asked? I was about to dismiss this. After all, what could be interesting about a bloom addict? They're all godless wastrels with no purpose nor direction in life. But the author of the Journal mentioned the following! By translating Old Aulmeria, these words revealed a different story. The words were vulgar and without grace, but it gives us something, something very very interesting!!\n\n> \"The Ferrod, the bloody damn lunatic. He actually dared fuck the princess of the Sea Dragons! He said he wanted a taste of that dragon pussy, what the fuck? And now he has the Harp of the Hoonding Souls. Now the Sea Dragons relearned how to walk the land. They're crossing half the continent to chase us!!!\"\n\nHarp of the Hoonding Souls? I've never heard of such artefacts. I visited the Imperial Library and asked every prestigious scholars possible, and they also have no idea what it is! Left no choice, I personally journeyed to the Dragon Archipelago to meet their locals and their scholars. And I made the right choice! I found a clue.\n\nThough they do not call it the \"Harp of Hoonding Souls\", they have a similar legend that I am a hundred percent certain is connected to what I'm investigating. The Legend goes that the"}}}}